<html>
    
    <head><title> Riesgos Inform&aacute;ticos</title><link rel="stylesheet" href="estilo.css"></head>
    
    <body>
        <header><div class="container"><h1>RIESGOS INFORM&Aacute;TICOS</h1></div></header>

        <h2 class="shi2">RIESGOS INFORM&Aacute;TICOS</h2>

        <br>
        <br>
        
        <h3 class="hh">¿Que son los riesgos informaticos y como afectan a las empresas?</h3>

        <br>
        <br>
        
    <p><img src="img/img1.jpg" width="550" height="290" align="left" class="img-left">La presente investigaci&oacute;n busca mostrar la manera en c&oacute;mo la tecnolog&iacute;a ha venido evolucionando gradualmente y con ella la manera de almacenar la informaci&oacute;n y la necesidad de ir aumentando cada vez más su protecci&oacute;n en bases de datos donde se almacena virtualmente toda la informaci&oacute;n correspondiente. Se analizan diferentes situaciones de riesgo, donde se ve afectada la informaci&oacute;n y las alternativas que se toman para contrarrestar, disminuir y controlar estos tipos de situaciones, tomando como base las buenas pr&aacute;cticas en la aplicaci&oacute;n de la seguridad inform&aacute;tica en los sistemas contables. Adem&aacute;s, se llev&oacute; a cabo una comparaci&oacute;n de los pa&iacute;ses como España y Colombia de las medidas tomadas para capacitar, prevenir y controlar aquellos delitos inform&aacute;ticos que se den dentro de una organizaci&oacute;n en el ejercicio de sus procesos contables a trav&eacute;s de sistemas digitales o computarizados (base de datos). En vista de que los riesgos inform&aacute;ticos son amenazas y vulnerabilidades que afectan en todos los aspectos a la empresa, y las consecuencias pueden ser muy graves en relaci&oacute;n a la informaci&oacute;n que se viene manejando, las personas dueñas de las empresas deben optar por estrategias que sean efectivas para disminuir o prevenir estas situaciones y que sean aplicadas de manera integral.</p>
  
    <p>Los sistemas contables que poseen cada empresa de este pa&iacute;s, suelen ser un blanco directo para aquellos ladrones de informaci&oacute;n financiera, por ello utilizan diferentes t&eacute;cnicas para obtener acceso a los servicios y redes que posee una empresa o persona, para as&iacute; poder tomar control y extraer toda la informaci&oacute;n necesaria. Es por ello que cada vez que los empleados est&eacute;n en su sitio de trabajo, deben tener presente algunas alternativas b&aacute;sicas de seguridad para proteger o contribuir de alguna manera a la conservaci&oacute;n de la informaci&oacute;n financiera de la empresa.</p>
 
    <p><img src="img/img2.jpg" width="410" height="230" align="right" class="img-right">Las situaciones de riesgo en el que se presentaron en estas empresas tienen lugar debido a las deficiencias que se presentan en las buenas pr&aacute;cticas en seguridad inform&aacute;tica, el desconocimiento de las actuaciones que se deben tener en cuenta, y el no pensar como estos ciberdelincuentes, debido a que si uno lo hace, se instaura autom&aacute;ticamente una barrera m&aacute;s estable, puesto que se tiene conocimiento de sus actuaciones y estrategias. Tomando como referencia los dos países estudiados, ambos brindan aspectos que son muy importantes a la hora de contrarrestar, prevenir y disminuir situaciones de ataques cibern&eacute;ticos, no solo exponen las ayudas que podemos adquirir para proteger nuestra informaci&oacute;n sino tambi&eacute;n los procesos, la informaci&oacute;n y la cultura que debemos tener a la hora de manipular datos que sean importantes en las organizaciones. Se muestra claramente que estos pa&iacute;ses tienen sus propias estrategias pero una puede servir de ejemplo para la otra y ayudarse mutuamente con el prop&oacute;sito de crear un ambiente de seguridad en el ciberespacio de todos los datos personales de cada una de las organizaciones y personas en general.</p>
 
    <p><img src="img/img3.jpeg" width="500" height="290" align="left" class="img-left">No se trata de que tan seguros sean los softwares contables, ni los sistemas t&eacute;cnicos que tenga la empresa para la prevenci&oacute;n de amenazas, sino de que tan capacitados est&aacute;n los empleados para no dejar visiblemente datos que pueden ser utilizados por los hackers, o aquellos sitios utilizados para la suplantación de p&aacute;ginas y robar las credenciales de acceso a los sistemas de una organizaci&oacute;n o simplemente el robo de la informaci&oacute;n al abrir un correo con un archivo adjunto; las buenas pr&aacute;cticas de generaci&oacute;n de conciencia en seguridad inform&aacute;tica es una buena y excelente alternativa de seguridad comercial de informació&oacute;n, debido a que se incorporan elementos de f&aacute;cil entendimiento y acceso, como lo son folletos, videos, informes de casos, etc. los cuales sirven como ejemplo y educaci&oacute;n, no solo para los empleados, sino también para los dueños y directivos de empresas; no basta con solo tener los mejores sistemas de protección contra intrusos, ya que aunque estos puedan prevenir los ataques efectivamente, el problema resulta de un punto ciego que no estamos prestando atenci&oacute;n y muchas empresas lo dejan a un lado, que son los trabajadores, el principal objetivo es que todos y cada uno de los integrantes de las empresas sepan c&oacute;mo actuar ante ataques cibern&eacute;ticos y tengan conocimiento de lo que puede ser sospechoso al momento de abrirlo.</p>

    <p>Esta es la alternativa de soluci&oacute;n m&aacute;s importante, que no solo los del &aacute;rea de sistema est&eacute;n capacitados, sino que todos est&eacute;n preparados para cualquier eventualidad.</p>
 
    <P>¿La raz&oacute;n? Los ciberdelincuentes est&aacute;n al acecho y en constante evoluci&oacute;n para aprovecharse de las vulnerabilidades y fallas que presenten los sistemas inform&aacute;ticos de las empresas, por eso, es fundamental estar protegidos e implementar buenas pr&aacute;cticas de ciberseguridad para evitar ser v&iacute;ctima de un ataque, que seg&uacute;n sus caracter&iacute;sticas, puede tener consecuencias como:</P>
 
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">interrucci&oacute;n de las actividades operativas o prestaci&oacute;n de servicios.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">Alteraciones, daños o p&eacute;rdidas de informaci&oacute;n sensible para la organizaci&oacute;n.</p>
   
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">Afectaciones econ&oacute;micas y a la reputaci&oacute;n.</p>
  
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">P&eacute;rdida de clientes y proveedores.</p>

    <br>
    <br>

    <h3 class="hh">3 tipos de ciberataques a tener en cuenta</h3>

    <br>
    <br>

    <p class="subdivision">1. Ransomware</p>
    
    <p>El principal ataque cibern&eacute;tico que se materializa en la regi&oacute;n. Consiste en un software malicioso que impide a los usuarios acceder a sus equipos inform&aacute;ticos o archivos, por eso, tambi&eacute;n se le conoce como secuestro de datos. Para que el usuario pueda recuperarlos, los ciberdelincuentes exigen un pago de cierta cantidad de dinero, es decir, los extorsionan; sin embargo, el pago no garantiza la recuperaci&oacute;n total de los datos. En general, el ransomware aprovecha las vulnerabilidades del sistema para instalarse en este y los hay de diferentes tipos, por ejemplo: criptogr&aacute;fico, bloqueador, doxware y scareware.</p>

    <center><img src="img/ransonware.webp" width="500"></center>

    <p class="subdivision">2. Phishing</p>

    <p>Se trata de la suplantaci&oacute;n de identidad de la que pueden ser v&iacute;ctima tanto las personas naturales como las organizaciones y entidades p&uacute;blicas. Este ciberataque se realiza con el fin de obtener informaci&oacute;n confidencial de los usuarios, principalmente datos bancarios como n&uacute;mero de tarjetas o contraseñas y se materializa a trav&eacute;s del env&iacute;o de correos electr&oacute;nicos, mensajes de texto o de WhatsApp que incluyen enlaces falsos y maliciosos que ponen en riesgo la informaci&oacute;n.</p>

    <center><img src="img/phishing2.png" width="500"></center>

    <p class="subdivision">3. Spyware</p>

    <p>Este ataque es un software malicioso que se instala en los equipos inform&aacute;ticos gracias a las vulnerabilidades que estos tienen o a estrategias de marketing engañoso. Su finalidad es espiar y acceder a informaci&oacute;n confidencial de los usuarios sin que se den cuenta porque act&uacute;a en un segundo plano existen diferentes tipos de spyware, por ejemplo: ladrones de contraseñas, troyanos bancarios y keyloggers, estos &uacute;ltimos tienen la capacidad de registrar las pulsaciones de las teclas y captar todas las actividades que se realicen en el ordenador.</p>

    <p>Sin duda, una buena estrategia de ciberseguridad es clave para prevenir este tipo de ataques. Igualmente es importante contar con un sistema de gesti&oacute;n de seguridad de la informaci&oacute;n sólido que permita gestionar estos y otros riesgos a los que est&aacute;n expuestos los activos de informaci&oacute;n.</p>

    <p>Un software como Pirani y su sistema de gesti&oacute;n de seguridad de la informaci&oacute;n permite a empresas como la tuya gestionarlos de manera m&aacute;s simple al identificar y crear diferentes procesos, riesgos, activos, controles y planes de acci&oacute;n para su mitigaci&oacute;n. Crea tu cuenta gratis y conoce m&aacute;s de todas las funcionalidades que tenemos para ti.</p>

    <center><img src="img/spyware.webp" width="500"></center>
        
    <h2 class="shi2">VULNERABILIDADES</h2>

    <br>
    <br>
        
    <h3 class="hh">¿Qu&eacute; son las vulnerabilidades inform&aacute;ticas?</h3>

    <br>
    <br>
        
        <p>Se considera una vulnerabilidad inform&aacute;tica a toda aquella debilidad que presente un software o hardware, que puede ser explotada por un ataque cibern&eacute;tico para acceder de forma no autorizada al sistema inform&aacute;tico, permitiendo que un atacante comprometa la integridad, disponibilidad o confidencialidad del sistema o los datos que all&iacute; procesa. Todo esto porque puede acceder a la memoria de un sistema, instalar malware y robar, destruir o modificar datos confidenciales. Pueden presentarse por fallos en el diseño, errores en la configuraci&oacute;n o por procedimientos no robustos. Las más peligrosas son aquellas que permiten que el atacante ejecute c&oacute;digos dañinos en el sistema comprometido. Sin embargo, para que un atacante pueda aprovechar dicha vulnerabilidad, debe poder conectarse al sistema inform&aacute;tico, y a pesar de esto son una de las principales causas por las cuales una empresa puede sufrir un ataque inform&aacute;tico contra sus sistemas. Los tipos m&aacute;s comunes de vulnerabilidades inform&aacute;ticas</p>

        <br>
        <br>
        
        <h3 class="hh">Ejemplos de vulnerabilidad y amenazas inform&aacute;ticas</h3>

        <br>
        <br>
        
        <p class="subdivision">Contraseñas débiles.</p>

        <p>El uso de contraseñas d&eacute;biles o la reutilizaci&oacute;n de contraseñas en varias cuentas es una pr&aacute;ctica com&uacute;n que pone a los usuarios de Internet en riesgo de apropiaci&oacute;n de cuentas, compromiso de datos y robo de identidad. El an&aacute;lisis de los comportamientos cibern&eacute;ticos de los consumidores revela el alcance de los riesgos de seguridad a los que las personas se exponen voluntariamente.</p>

        <p>Algunos datos de los malos h&aacute;bitos de ciberseguridad son los siguientes:</p>
            
        <p>Seg&uacute;n la encuesta del año pasado sobre comportamientos en l&iacute;nea , la reutilizaci&oacute;n de contraseñas es com&uacute;n entre el 53 %. 38 % de los encuestados rechaza el uso de la autenticaci&oacute;n multifactor, a pesar de las m&uacute;ltiples indicaciones para hacerlo y agregar una capa de seguridad adicional a sus cuentas y datos. Si sus cuentas de correo electr&oacute;nico y de redes sociales est&aacute;n comprometidas, no le tomar&iacute;a mucho tiempo a un ladr&oacute;n cibern&eacute;tico experimentado bloquear sus cuentas; las respuestas a las preguntas de recuperaci&oacute;n de cuentas se pueden encontrar f&aacute;cilmente en las redes sociales o b&uacute;squedas en Internet.</p>
            
        <p>Recomendaciones para una buena contraseña:</p>
            
        <p>No debe incluir combinaciones num&eacute;ricas y de palabras obvias, como su n&uacute;mero de tel&eacute;fono, direcci&oacute;n, apellido de soltera de su madre no utilizar cadenas num&eacute;ricas como "12345678". Utilice una combinaci&oacute;n de caracteres en may&uacute;sculas y min&uacute;sculas y caracteres especiales al elegir sus contraseñas, que deben ser &uacute;nicas para cada uno de sus inicios de sesi&oacute;n.</p>

        <br>
        <br>
        <br>

        <center><img src="img/contraseñadebil.jpg" align="center"></center>

        <br>
        <br>
        <br>
        
        <p class="subdivision">Software que ya est&aacute; infectado con virus.</p>

        <p>Es mucho m&aacute;s com&uacute;n que el uso del malware venga determinado por un objetivo: espiar datos y sacar provecho de ellos, colocar anuncios y ofertas de compra, sabotear determinados sistemas inform&aacute;ticos o controlar ordenadores ajenos y utilizarlos para fines concretos. El malware intenta, as&iacute;, pasar desapercibido para poder utilizar el equipo invadido el m&aacute;ximo de tiempo posible. No obstante, hay ciertos s&iacute;ntomas que se pueden identificar para saber si un ordenador ha sido v&iacute;ctima de un software malicioso:</p>

        <br>
        <br>
        <br>

        <center><img src="img/software.jpg" align="center" width="800"></center>

        <br>
        <br>
        <br>

        <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">El equipo se apaga de manera espont&aacute;nea, no se puede volver a encender o el sistema se bloquea de repente.</p>
            
        <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">El equipo funciona m&aacute;s lento de lo normal (debido a un aumento en la carga del procesador).</p>

        <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">La velocidad de Internet es m&aacute;s lenta de lo normal (debido a un elevado tr&aacute;fico de datos).</p>

        <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Aumenta la asiduidad con la que aparecen contenidos indeseados de Internet, tales como ventanas emergentes, reenv&iacute;o autom&aacute;tico a ciertas direcciones de Internet o acceso repentino a una nueva p&aacute;gina web, buscador o nuevas barras de herramientas en el navegador.</p>

        <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Los programas se desinstalan o bloquean de repente. Algunos elementos dañinos pueden, incluso, desactivar programas antivirus y cortafuegos, lo que se convierte en otro indicio de que el sistema ha sido infectado con un malware.</p>

        <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Se instalan programas no deseados y algunos se abren solos.</p>
        
        <p class="subdivision">Bugs.</p>

        <p>Es un t&eacute;rmino que suele aparecer en muchas noticias tecnol&oacute;gicas, pero para algunas personas no se trata de un concepto claro. Max Kanat-Alexander, autor del libro «Code Simplicity: The Science of Software Development» e ingeniero en Google, explica el origen del t&eacute;rmino. «Bug» es un t&eacute;rmino en ingl&eacute;s, cuya traducci&oacute;n literal es insecto, aunque en el argot de la inform&aacute;tica tiene otro significado. El ingeniero explica en su blog oficial que a muchos programadores le han contado que alguien encontr&oacute; un insecto dentro de un ordenador y estaba ocasionando problemas. De ah&iacute;, cuenta la leyenda, comenz&oacute; el t&eacute;rmino, aun que al parecer, dice Kanat-Alexander, alguno ingenieros ya hab&iacute;an utilizado «bug» para referirse a un problema inform&aacute;tico. Un «bug», se puede referir a dos situaciones. La primera, el programa (ll&aacute;mese Candy Crush, Soundcloud o Facebook) no se comporta seg&uacute;n las intenciones del programador, de su creador. La segunda, las intenciones del inform&aacute;tico no satisfacen las expectativas razonables del usuario.</p>
  
        <p>«As&iacute; que, mientras el programa haga todo lo que el inform&aacute;tico intent&oacute; que hiciera, quiere decir que funciona correctamente. A veces lo que intent&oacute; hacer el programador es totalmente sorpresivo para el usuario y causa problemas, eso es un bug», señala. Es decir, es un fallo no intencionado en el c&oacute;digo de escritura de un programa. Los «bugs» no se presentan solo en software, tambi&eacute;n puede haber errores en hardware. Kanat-Alexander señala que es muy raro que un programador tenga intenci&oacute;n de hacer explotar un ordenador, por lo que si el inform&aacute;tico escribe un software y el ordenador colapsa, lo m&aacute;s m&aacute;s probable es que se haya tratado de un error f&iacute;sico en el PC. Este es un ejemplo exagerado, ya que los bug de hardware tambi&eacute;n pueden ocasionar consecuencias menos dram&aacute;ticas.</p>

        <br>
        <br>
        <br>

        <center><img src="img/bugs.webp" align="center" width="1000"></center>

        <br>
        <br>
        <br>
  
        <p>El ingeniero explica que hay una excepci&oacute;n al bug. Por ejemplo, el programador escribe un software en un ordenador que no est&eacute; capacitado y este falla. En ese caso la situaci&oacute;n no puede ser considerada como «bug». Por ejemplo, el inform&aacute;tico le dice al ordenador «bebe agua», pero la m&aacute;quina no est&aacute; diseñada para «beber agua», as&iacute; que no puede realizar la acci&oacute;n. Eso no es un «bug» sino que los ingenieros deber&iacute;an añadir esa funci&oacute;n al ordenador.</p>
    
        <p>Un bug en un software ocasiona que el programa colapse o que de errores. La mayor&iacute;a de los bugs son fallos humanos. Un programa lleno de bugs es calificado como «buggy». Algunos bugs pueden que no causen efectos severos en la funcionalidad del programa y puede pasar mucho tiempo sin ser detectado. Hay otra categor&iacute;a de bugs que afecta a la seguridad. Este tipo de errores en el c&oacute;digo, puede permitir que un usuario con malas intenciones pueda acceder a los controles de un programa y obtener privilegios sin autorizaci&oacute;n. Entre los bugs m&aacute;s recientes de seguridad se encuentra el «Heartbleed» . Este error estaba en el c&oacute;digo de creaci&oacute;n de la librer&iacute;a OpenSSL, una herramienta que usaban millones de p&aacute;ginas webs y miles de aplicaciones para encriptar los datos. El año pasado, el la primera actualizaci&oacute;n del iOS 8 de Apple incorpor&oacute; un bug que eliminaba la conexi&oacute;n a la red celular, es decir, no pod&iacute;an hacer llamadas o conectarse a trav&eacute;s de datos y tambi&eacute;n dañaba el Touch ID de los iPhone 6 y iPhone 6 Plus.</p>

        <p>En 1990 se encontr&oacute; un bug en un software de AT&T en las m&aacute;quinas 4ESS, que permitía activar los ordenadores a distancia. Caus&oacute; el colapso de varios ordenadores.</p>
        
        <p class="subdivision">Falta de cifrado de datos.</p>

        <p>Hoy en d&iacute;a es m&aacute;s sencillo cifrar que hace años. Las herramientas de cifrado son cada vez m&aacute;s comunes, as&iacute; como los fabricantes que desarrollan soluciones profesionales personalizadas para corporaciones y empresas de todos los tamaños. Como lo mencionamos en el blog anterior el cifrado es un m&eacute;todo para evitar que alguien no pueda tener acceso a informaci&oacute;n que se desea preservar. Este m&eacute;todo consiste en alterar un mensaje antes de transmitirlo, generalmente mediante la utilizaci&oacute;n de una clave, de modo que su contenido no sea legible para los que no posean dicha clave. De esta forma, cualquier persona que tenga acceso al mensaje no podr&aacute; entender su contenido a menos que cuente con la clave para descifrarlo.</p>

        <br>
        <br>
        <br>

        <center><img src="img/cifrado.webp" align="center"></center>

        <br>
        <br>
        <br>

        <p>No solo es necesario cifrar, sino tambi&eacute;n hacerlo de manera que la informaci&oacute;n no sea inteligible ni manipulada por terceros. Sin esta &uacute;ltima condici&oacute;n, el cifrado no tendr&iacute;a valor.</p>

        <p>Esto implica que el sistema de cifrado a emplear no est&eacute; comprometido, es decir, que no se conozca forma de romperlo. En otras palabras, hay que utilizar mecanismos de cifrado robustos. El estado de los mecanismos de cifrado son din&aacute;micos, es decir, un mecanismo puede ser robusto hoy, pero dentro de un tiempo ya no. Por lo tanto, hay que permanecer informados y actualizados sobre las vulnerabilidades que puedan aparecen en los mecanismos utilizados.</p>

        <p class="subdivision">Redireccionamiento de URL a sitios no confiables.</p>

        <p>Un sitio web es vulnerable a Open Redirect cuando los valores de par&aacute;metros (la porci&oacute;n de URL despu&eacute;s de “?”) en una solicitud HTTP GET permiten informaci&oacute;n que redirigir&aacute; a un usuario a un nuevo sitio web sin ninguna validaci&oacute;n del objetivo de redireccionamiento. Dependiendo de la arquitectura de un sitio web vulnerable, la redirecci&oacute;n podr&iacute;a ocurrir despu&eacute;s de cierta acci&oacute;n, como el inicio de sesi&oacute;n, y a veces podr&iacute;a ocurrir instant&aacute;neamente al cargar una p&aacute;gina.</p>

        <br>
        <br>
        <br>

        <center><img src="img/openre.png" align="center"></center>

        <br>
        <br>
        <br>
        
        <p class="subdivision">Cross-site scripting y falsificaci&oacute;n.</p>

        <p>¿Qu&eacute; es el scripoting o falsificaci&oacute;n?</p>
        
        <p>El scripting entre sitios (XSS) es un ataque en el que el atacante adjunta c&oacute;digo en un sitio web leg&iacute;timo que se ejecutar&aacute; cuando la v&iacute;ctima cargue el sitio web. Ese c&oacute;digo malicioso puede insertarse de varias maneras. Lo m&aacute;s popular es añadirlo al final de una url o colocarlo directamente en una p&aacute;gina que muestre contenido generado por el usuario. En t&eacute;rminos m&aacute;s t&eacute;cnicos, el scripting entre sitios es un ataque de inyecci&oacute;n de c&oacute;digo del lado del cliente.</p>

        <br>
        <br>
        <br>

        <center><img src="img/scripting.png" width="1000" height="500"></center>

        <br>
        <br>
        <br>

        <p>¿Qu&eacute; es un ejemplo de scripting entre sitios? </p>>

        <p>Un ejemplo &uacute;til de ataques de scripting entre sitios es el que suele verse en los sitios web que tienen foros de comentarios sin validar. En este caso, un atacante publica un comentario que consiste en un c&oacute;digo ejecutable envuelto en etiquetas script /script. Estas etiquetas indican al navegador web que interprete todo lo que hay entre ellas como c&oacute;digo JavaScript. Una vez que ese comentario est&eacute; en la p&aacute;gina, cuando cualquier otro usuario cargue ese sitio web, el c&oacute;digo malicioso entre las etiquetas script ser&aacute; ejecutado por su navegador web, y se convertir&aacute; en v&iacute;ctima del ataque.</p>
            
    <h2 class="shi2">AMENAZAS PRINCIPALES</h2>

    <br>
    <br>
    
    <h3 class="hh">#1. Virus inform&aacute;ticos</h3>

    <br>
    <br>

    <p><img src="img/virus.png" align="left" width="300" height="250" class="img-left">Son las amenazas m&aacute;s conocidas por el p&uacute;blico no especializado en temas de inform&aacute;tica. Se trata, b&aacute;sicamente, de c&oacute;digo con el que se infecta un programa ejecutable y que se propaga copi&aacute;ndose a s&iacute; mismo e infectando a otros programas o archivos. Sus consecuencias y su gravedad var&iacute;an mucho. Algunos virus solo tienen como finalidad gastar una broma al usuario; otros pueden provocar el mal funcionamiento del software, dañar el hardware o incluso infectar a toda una red de usuarios. Los virus siempre necesitan de la acci&oacute;n humana para activarse (por ejemplo, ejecutando el usuario software infectado por desconocimiento). Las p&eacute;rdidas econ&oacute;micas si llega a dañar el software de la empresa, el sistema operativo o los propios equipos y dispositivos pueden ser muy cuantiosas. Mant&eacute;n tu antivirus actualizado, no te puedes imaginar la cantidad de tiempo perdido y el dinero que pierden las empresas teniendo a sus empleados de brazos cruzados por no haber invertido un poco de tiempo y dinero en actualizar su Antivirus.</p>

    <h3>Tipos de virus inform&aacute;ticos</h3>

    <p class="subdivision">Virus de sector de arranque</p>
    
    <p>El disco duro de su ordenador tiene un sector cuyo &uacute;nico prop&oacute;sito es orientar al sistema operativo, para que este pueda iniciar la interfaz. Un virus de sector de arranque daña o controla el sector de arranque del disco, inutilizando al equipo. Los atacantes suelen diseminar este tipo de virus mediante un dispositivo USB malintencionado. El virus se activa cuando los usuarios conectan el dispositivo USB y arrancan su equipo.</p>

    <p class="subdivision">Virus de script</p>

    <p>La mayor&iacute;a de los navegadores tienen defensas contra los scripts malintencionados, pero los navegadores m&aacute;s antiguos u obsoletos tienen vulnerabilidades que pueden permitir a un delincuente cibern&eacute;tico ejecutar c&oacute;digo en el dispositivo local.</p>

    <p class="subdivision">Secuestrador del navegador</p>

    <p>Hay virus que pueden cambiar la configuraci&oacute;n de su navegador y funcionan secuestrando los enlaces favoritos de su navegador, la URL de la p&aacute;gina de inicio y sus preferencias de b&uacute;squeda, para redirigirle a una p&aacute;gina malintencionada. La web podr&iacute;a ser una web de phishing o de adware usada para robar datos o para ganar dinero por parte del atacante.</p>

    <p class="subdivision">Virus residentes</p>

    <p>Estos virus residentes se incrustan en la memoria del ordenador y permanecen ocultos hasta ser activados. Este malware puede permanecer en hibernaci&oacute;n hasta una fecha u hora espec&iacute;ficas, o hasta que un usuario ejecuta una cierta acci&oacute;n.</p>

    <p class="subdivision">Virus de acci&oacute;n directa</p>

    <p>Cuando un usuario ejecuta un archivo aparentemente inocuo pero que en realidad contiene c&oacute;digo malintencionado, los virus despliegan su carga &uacute;til de inmediato. Estos tipos de virus pueden permanecer suspendidos hasta que se toma una acci&oacute;n espec&iacute;fica o transcurra un cierto per&iacute;odo de tiempo.</p>

    <p class="subdivision">Virus polim&oacute;rfico</p>

    <p>Los creadores del malware pueden usar c&oacute;digo polim&oacute;rfico para cambiar la huella del programa y as&iacute; evitar su detecci&oacute;n. Los virus polim&oacute;rficos les dificultan a los antivirus el detectarlos y eliminarlos.</p>

    <p class="subdivision">Virus que infecta archivos</p>

    <p>Para persistir en un sistema, el autor de la amenaza emplea virus inyectores con c&oacute;digo malintencionado para infectar archivos clave que ejecutan el sistema operativo o programas importantes. Cuando el sistema arranca o se ejecuta el programa, el virus se activa.</p>

    <p class="subdivision">Virus multipartitos</p>

    <p>Estos programas malintencionados se diseminan por las redes de otros sistemas, bien copi&aacute;ndose as&iacute; mismos o inyectando c&oacute;digo en recursos inform&aacute;ticos esenciales.</p>

    <p class="subdivision">Virus de macros</p>

    <p>Los archivos de Microsoft Office pueden ejecutar macros, y estas macros se pueden usar para descargar malware adicional o ejecutar c&oacute;digo malintencionado. Los virus macro despliegan su carga útil cuando se abre el archivo y se ejecutan los macros.</p>

    <br>
    <br>
    <br>

    <div class="align-center"><p><img src="img/sectorarranque.png" align="left" width="400" height="230" class="img-left"><img src="img/script.jpg" align="left" width="400" height="230" class="img-left"><img src="img/secuestradornav.png" align="left" width="400" height="230"></p></div>
        
    <div class="align-center"><p><img src="img/residente.jpg" align="left" width="400" height="230" class="img-left"><img src="img/acciondirecta.jpg.crdownload" align="left" width="400" height="230" class="img-left"><img src="img/polimorfico.webp" align="left" width="400" height="230" class="img-left"></p></div>
        
    <div class="align-center"><p><img src="img/virusarchivos.webp" align="left" width="400" height="230" class="img-left"><img src="img/multipartitos.png" align="left" width="400" height="230" class="img-left"><img src="img/macro.png" align="left" width="400" height="230" class="img-left"></p></div>

    <br>
    <br>
    <br>

    <h3>Causas de infección de virus</h3>

    <p>Los virus inform&aacute;ticos son programas normales; la diferencia estriba en que, en vez de ofrecer recursos &uacute;tiles, estos programas pueden dañar su dispositivo. Para que un atacante pueda infectar un virus en su equipo, usted debe iniciar la ejecuci&oacute;n. En algunos casos, un hacker puede ejecutar c&oacute;digo malintencionado mediante su navegador o de manera remota desde otro equipo en la red. Los navegadores modernos tienen defensas contra ejecuci&oacute;n de c&oacute;digo en equipos locales, pero los softwares externos instalados en el navegador podr&iacute;an tener vulnerabilidades que permiten a los virus ejecutarse localmente. Las t&eacute;cnicas de infecci&oacute;n usadas por los virus inform&aacute;ticos son variadas. Un m&eacute;todo com&uacute;n es mediante un correo electr&oacute;nico de phishing. Otra t&eacute;cnica consiste en alojar malware en un servidor que promete ofrecer un programa leg&iacute;timo. Se puede instalar mediante macros o inyectando c&oacute;digo malintencionado en archivos de software leg&iacute;timos.</p>

    <h3>¿C&oacute;mo funcionan los virus?</h3>

    <p>La manera en que act&uacute;a un virus inform&aacute;tico depende de c&oacute;mo est&eacute; codificado. Podr&iacute;a ser desde algo tan sencillo como una broma que no causa daño alguno, hasta un programa muy sofisticado con el objetivo de realizar actividades criminales y fraude. Muchos virus solamente afectan a dispositivos locales, pero otros se diseminan por entornos de red para encontrar a otros anfitriones vulnerables. Un virus que infecta a un dispositivo anfitri&oacute;n sigue insertando la carga &uacute;til hasta que se le elimina. La mayor&iacute;a de los proveedores de antivirus tienen pequeños programas que eliminan el virus. Los virus polim&oacute;rficos dificultan la eliminaci&oacute;n porque cambian su huella constantemente. La carga &uacute;til podr&iacute;a estar robando datos, destruyendo datos o interrumpiendo servicios en la red o en el dispositivo local.</p>

    <h3>¿C&oacute;mo se detecta un virus inform&aacute;tico?</h3>

    <p>Los creadores de malware generan c&oacute;digo que resulta muy dif&iacute;cil de detectar hasta que se ejecuta la carga &uacute;til. Sin embargo, al igual que con cualquier programa de software, pueden ocurrir errores mientras se ejecuta el virus. Algunas señales de que podr&iacute;a tener un virus inform&aacute;tico en el PC son:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Ventanas emergentes, incluyendo anuncios (adware) o enlaces a p&aacute;ginas web malintencionadas.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">La p&aacute;gina de inicio de su navegador web es diferente, pero usted no la ha cambiado.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Env&iacute;o autom&aacute;tico de correos electr&oacute;nicos a su lista de contactos o recepci&oacute;n de mensajes de personas en su lista de contactos que le alertan de que su cuenta est&aacute; enviando mensajes extraños.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">El ordenador se cuelga con frecuencia, se le agota la memoria con unos pocos programas activos o aparece la pantalla azul de la muerte de Windows.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Un bajo rendimiento del ordenador, incluso cuando se ejecutan relativamente pocos programas o se acaba de arrancar el sistema.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Se inician programas desconocidos cuando el ordenador arranca o cuando se abren programas espec&iacute;ficos.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Las contraseñas cambian sin su conocimiento o sin haber interactuado con la cuenta.</p>

    <br>
    <br>

    <h3 class="hh">#2. Gusanos</h3>

    <br>
    <br>
        
    <p><img src="img/gusano.avif" align="right" width="400" height="270" class="img-right">¿Qu&eacute; nombre les ponen verdad? pero es que se comportan as&iacute; y te aseguro que no se convierten en mariposas. A menudo se confunden con los virus. Sin embargo, los gusanos, a diferencia de ellos, no necesitan de la acci&oacute;n humana para activarse, copiarse a s&iacute; mismos y propagarse por la red. ¡Porque eso es lo que hacen! Pueden, por ejemplo, copiarse y enviarse a cada uno de tus contactos mediante tu servicio de correo electr&oacute;nico o mensajer&iacute;a instant&aacute;nea, y repetir la operaci&oacute;n con la libreta de direcciones de cada uno de tus contactos. Su capacidad de propagaci&oacute;n crece de forma exponencial. Los gusanos suelen colapsar los ordenadores, los servidores y la red, acaparando recursos, consumiendo ancho de banda y provocando serios problemas de rendimiento. Pero también se pueden utilizar con fines todav&iacute;a m&aacute;s oscuros, como el de crear grandes redes de ordenadores Zombie, controlados por bots que los pueden usar para enviar spam de forma masiva, lanzar ciberataques o descargar todo tipo de malware en el equipo. ¿Imaginas cu&aacute;nto daño pueden hacer los gusanos en tus equipos inform&Aacute;ticos y tu red de trabajo…? Los gusanos inform&aacute;ticos son peligrosos a causa de su capacidad. Tan pronto como un gusano se afianza en una m&aacute;quina anfitriona, puede extenderse a trav&eacute;s de una red sin necesidad de ayuda o de acciones externas. Como malware aut&oacute;nomo, los gusanos no necesitan engañarle para que los active, como sucede con los troyanos. Los gusanos explotan vulnerabilidades ocultas en el sistema operativo (S.O.) de su equipo. Los hackers crean gusanos que pueden penetrar en el S.O. de destino y hacer el trabajo sucio sin su conocimiento. M&aacute;s adelante, le mostraremos c&oacute;mo averiguar si su equipo tiene un gusano para que pueda tomar medidas para eliminarlo. Durante muchos años, los gusanos utilizaron medios f&iacute;sicos para entrar en una red. El hacker pon&iacute;a su gusano en un disquete u otra unidad y esperaba a que su v&iacute;ctima lo insertara en el equipo. A&uacute;n hoy, esa t&aacute;ctica es viable: muchos actos de espionaje y sabotaje industrial se llevan a cabo mediante una unidad flash USB aparentemente inocua. Sin embargo, ahora es mucho m&aacute;s corriente encontrar gusanos que se propagan a trav&eacute;s de medios puramente electr&oacute;nicos, como el correo electr&oacute;nico, los servicios de mensajer&iacute;a instant&aacute;nea y las redes de intercambio de archivos.</p>

    <h3>Tipos de gusanos</h3>

    <p>Podemos dividirlos en varias categor&iacute;as seg&uacute;n la forma de propagaci&oacute;n. Cada categor&iacute;a utiliza un vector de ataque para propagarse de m&aacute;quina en m&aacute;quina.</p>

    <p class="subdivision"><img src="img/gusanocorreo.webp"> Gusanos de correo electr&oacute;nico</p>

    <p>Como ya habr&aacute; adivinado, su vector de infecci&oacute;n es el correo electr&oacute;nico. Los gusanos de correo electr&oacute;nico toman el control sobre el cliente de correo de su equipo y env&iacute;an correos a cualquier contacto de su lista. ¿El truco? Esos mensajes distribuyen el gusano entre sus contactos, y luego a los contactos de estos, y as&iacute; sucesivamente, lo que les permite propagarse de forma exponencial. Algunos de estos correos electr&oacute;nicos incluyen archivos adjuntos que, cuando se descargan, ejecutan e instalan el gusano en el equipo del destinatario. Otros incorporan enlaces acortados en el cuerpo del correo electr&oacute;nico para conducir a los lectores a sitios web maliciosos que descargan autom&aacute;ticamente el gusano. Los gusanos de correo electr&oacute;nico que han conseguido mayor &eacute;xito utilizan diversas t&eacute;cnicas de ingenier&iacute;a social para convencer a sus v&iacute;ctimas de que descarguen archivos adjuntos o hagan clic en un enlace.</p>

    <p class="subdivision"><img src="img/gusanomensa.webp"> Gusanos de mensajer&iacute;a instant&aacute;nea</p>
    
    <p>En lugar de secuestrar el cliente de correo electr&oacute;nico de su equipo para realizar sus fechor&iacute;as, los gusanos de mensajer&iacute;a instant&aacute;nea prefieren algo m&aacute;s espont&aacute;neo. Se infiltran en una plataforma de mensajer&iacute;a, como Skype, Messenger o WhatsApp y luego env&iacute;an un mensaje a todos sus contactos. El mensaje, escrito de forma similar a un clickbait (LOL/OMG, ¡tienes que ver esto!), intenta convencer a sus contactos de que les ha enviado un enlace a un contenido viral divertido. Pero en lugar de ello, cuando su amigo hace clic, visita un sitio web infectado. Mientras tanto, el gusano pasa el mensaje a todos los miembros de la lista de contactos de su amigo, lo que le ayuda a extenderse m&aacute;s r&aacute;pidamente.</p>

    <p class="subdivision"><img src="img/gusanoint.webp"> Gusanos de intercambio de archivos</p>

    <p>Cada d&iacute;a aparecen nuevas plataformas de streaming. Pero incluso ahora que el streaming se ha convertido en el modo de consumo multimedia m&aacute;s extendido, muchos a&uacute;n prefieren obtener su m&uacute;sica, pel&iacute;culas y programas de televisi&oacute;n a trav&eacute;s de redes de intercambio de archivos de igual a igual. (Por cierto, si lo hace, deber&iacute;a utilizar una VPN). Esas redes de intercambio de archivos operan de una forma dudosamente legal (casi nunca est&aacute;n reguladas), por lo que los hackers pueden incrustar f&aacute;cilmente gusanos en archivos con una gran demanda. Cuando descarga los archivos infectados, el gusano se copia a s&iacute; mismo en su equipo y contin&uacute;a su trabajo. Tenga cuidado la pr&oacute;xima vez que quiera conseguir una pel&iacute;cula o un &aacute;lbum de m&uacute;sica sin pagar.</p>

    <p class="subdivision"><img src="img/gusanored.webp"> Gusanos de Internet (o gusanos de red)</p>

    <p>A diferencia de los tipos de gusanos mencionados anteriormente, que explotan alg&uacute;n tipo de comportamiento humano para propagarse, los gusanos de Internet no interact&uacute;an con sus v&iacute;ctimas. Los hackers usan gusanos de Internet o de red para aprovechar las vulnerabilidades de un sistema operativo. Otros gusanos pueden explotar otros servicios o fallos de seguridad, como contraseñas no seguras. Desde su posici&oacute;n en un equipo infectado, el gusano de red busca en Internet o en una red de &aacute;rea local (LAN) m&aacute;s equipos con la misma vulnerabilidad y se propaga a esas m&aacute;quinas. Por ejemplo, el gusano Mirai infecta dispositivos del Internet de las cosas (IoT) con las credenciales de inicio predeterminadas. Como muchos gusanos de Internet se aprovechan de las vulnerabilidades del software, puede ir un paso por delante de ellos actualizando su S.O., programas y aplicaciones a las versiones m&aacute;s recientes en cuanto est&eacute;n disponibles.</p>

    <h3>¿Qu&eacute; pueden hacer los gusanos inform&aacute;ticos?</h3>

    <p>Al principio, no ten&iacute;an otro objetivo que proliferar tanto como fuera posible. Los primeros hackers crearon estos gusanos por pura diversi&oacute;n, para mostrar sus habilidades o para exponer los agujeros y vulnerabilidades de los sistemas operativos del momento. Aunque no fueron diseñados expresamente para ello, esos «gusanos puros» sol&iacute;an causar daños o interrupciones como efecto secundario. Un gusano hambriento de recursos podr&iacute;a ralentizar o incluso bloquear el equipo anfitri&oacute;n usando demasiada potencia de procesamiento, mientras que otros gusanos saturaban las redes ocupando ancho de banda para propagarse. Finalmente, y por desgracia para nosotros, los hackers pronto se dieron cuenta de que los gusanos pod&iacute;an usarse como mecanismos de propagaci&oacute;n de otros tipos de malware. En estos casos, el c&oacute;digo adicional que lleva el gusano se conoce como «carga &uacute;til». Es com&uacute;n dotar a los gusanos de una carga &uacute;til que abre una «puerta trasera» en las m&aacute;quinas infectadas, lo que permite al ciberdelincuente tomar el control del sistema. Otras cargas &uacute;tiles recopilan datos personales confidenciales, instalan ransomware o convierten los dispositivos en «zombis» para usarlos en ataques de botnet.</p>

    <h3>Historia de los gusanos inform&aacute;ticos</h3>

    <p>Algunas de las cepas de malware m&aacute;s destructivas han sido gusanos inform&aacute;ticos. Echemos un vistazo a algunos de los tipos de gusanos inform&aacute;ticos tristemente m&aacute;s famosos:</p>

    <p class="subdivision">El gusano Morris</p>

    <p>El estudiante de posgrado Robert Tappan Morris inici&oacute; la era de los gusanos inform&aacute;ticos liberando su creaci&oacute;n el 2 de noviembre de 1988. Morris no pretend&iacute;a causar ning&uacute;n daño, pero debido a la forma en la que estaba escrito, el gusano consigui&oacute; infectar reiteradas veces muchas de las m&aacute;quinas anfitrionas. Esto dio lugar al colapso masivo de equipos y dej&oacute; inutilizada una parte de la entonces incipiente Internet hasta que el gusano pudo ser eliminado de las m&aacute;quinas infectadas. Como consecuencia del daño causado por su gusano, que se estima entre cientos y miles de millones de d&oacute;lares, Morris se convirti&oacute; en la primera persona condenada en virtud de la Ley de abuso y fraude inform&aacute;tico de los EE. UU. de 1986.</p>

    <p class="subdivision">ILOVEYOU</p>

    <p>El gusano ILOVEYOU, llamado as&iacute; por el mensaje de correo electr&oacute;nico que utiliz&oacute; para propagarse, surgi&oacute; en Filipinas a principios del año 2000 y se extendi&oacute; r&aacute;pidamente por todo el mundo. A diferencia del gusano Morris, ILOVEYOU era un gusano malicioso diseñado para sobrescribir archivos aleatoriamente en los equipos de sus v&iacute;ctimas. Despu&eacute;s de atacar la m&aacute;quina anfitriona, ILOVEYOU enviaba copias de s&iacute; mismo por correo electr&oacute;nico a trav&eacute;s de Microsoft Outlook a todos los contactos en la libreta de direcciones de Windows de la v&iacute;ctima. ILOVEYOU caus&oacute; p&eacute;rdidas por valor de miles de millones de d&oacute;lares en todo el mundo, lo que lo convirti&oacute; en uno de los gusanos inform&aacute;ticos m&aacute;s famosos.</p>
    
    <p class="subdivision">SQL Slammer</p>

    <p>SQL Slammer fue un gusano de Internet de fuerza bruta que se propag&oacute; a la velocidad del rayo en el año 2003 e infect&oacute; aproximadamente 75 000 v&iacute;ctimas en solo 10 minutos. En lugar de utilizar la t&aacute;ctica de propagaci&oacute;n por correo electr&oacute;nico de ILOVEYOU o de sus primos Storm Worm y Nimda, SQL Slammer atacaba una vulnerabilidad de Microsoft SQL Server para Windows 2000. SQL Slammer generaba direcciones IP aleatorias y luego enviaba copias de s&iacute; mismo a los equipos con esas direcciones. Si el equipo receptor ten&iacute;a una versi&oacute;n de SQL Server sin parchear que a&uacute;n presentaba la vulnerabilidad, SQL Slammer entraba y se pon&iacute;a en funcionamiento. Convert&iacute;a los equipos infectados en botnets, que luego se utilizar&iacute;an para lanzar ataques DDoS. A pesar de que el parche de seguridad estaba disponible desde 2002, incluso antes de la ola inicial de ataques, SQL Slammer resurgi&oacute; en 2016 y 2017.</p>

    <p class="subdivision">WannaCry</p>

    <p>WannaCry es un ejemplo m&aacute;s reciente de lo devastadores que pueden ser los gusanos, incluso con herramientas modernas de ciberseguridad. El gusano WannaCry, de 2017, tambi&eacute;n es un ejemplo de ransomware, ya que cifraba los archivos de sus v&iacute;ctimas y exig&iacute;a el pago de un rescate para recuperar el acceso. En un solo d&iacute;a, WannaCry infect&oacute; 230 000 PC en 150 pa&iacute;ses, incluyendo objetivos de alto nivel, como el Servicio Nacional de Salud de Gran Bretaña y muchas otras ramas gubernamentales, universidades y empresas privadas. WannaCry usaba la vulnerabilidad EternalBlue para atacar versiones anteriores a Windows 8. Cuando el gusano encontraba un equipo vulnerable, instalaba una copia de s&iacute; mismo, empezaba a cifrar los archivos de la v&iacute;ctima y, una vez completado el proceso, mostraba una nota de rescate.</p>

    <h3>C&oacute;mo reconocer los gusanos inform&aacute;ticos</h3>

    <p>Existen varios signos que indican la presencia de un gusano inform&aacute;tico en su dispositivo. Aunque los gusanos suelen actuar sigilosamente, sus actividades pueden producir efectos notables en la v&iacute;ctima, incluso si el gusano no est&aacute; realizando ninguna actividad maliciosa de forma intencionada. Busque estos s&iacute;ntomas para saber si su equipo tiene un gusano:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Su equipo se ralentiza o falla: Algunos gusanos, como el cl&aacute;sico gusano Morris que ya hemos mencionado anteriormente, pueden consumir tantos recursos del equipo que apenas dejen capacidad libre para su funcionamiento normal. Si su equipo se ralentiza de repente, no responde o comienza a fallar, puede deberse a un gusano inform&aacute;tico.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Se est&aacute; quedando sin almacenamiento: Como el gusano se replica, tiene que guardar todas esas copias en alguna parte. Si el espacio libre de almacenamiento de su equipo disminuye de forma anormal, averigue qu&eacute; ocupa todo ese espacio; podr&iacute;a ser un gusano.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Su equipo se comporta de forma extraña: Dado que muchos gusanos se propagan aprovechando las comunicaciones directas, busque correos electr&oacute;nicos o mensajes salientes que no haya enviado usted mismo. Alertas extrañas, cambios sin explicaci&oacute;n o archivos nuevos o desaparecidos tambi&eacute;n podr&iacute;an denotar la actividad de un gusano.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Sus contactos le preguntan qu&eacute; sucede: Puede que no note ninguna de las señales anteriores. Todos pasamos cosas por alto. Pero si tiene un gusano de correo electr&oacute;nico o de mensajer&iacute;a instant&aacute;nea, puede que alguno de sus contactos le pregunte por el extraño mensaje que ha recibido de su parte. Nunca es demasiado tarde para solucionar una infestaci&oacute;n por gusanos, incluso si ya han comenzado a propagarse.</p>

    <h3>C&oacute;mo evitar los gusanos inform&aacute;ticos</h3>

    <p>Si un gusano logra acceder a su dispositivo, las consecuencias pueden ser graves. Lo bueno es que la prevenci&oacute;n de gusanos inform&aacute;ticos se reduce a unos pocos h&aacute;bitos sensatos e inteligentes aplicables al malware en general. Si a&uacute;n no lo ha hecho, incorpore los siguientes consejos a su estilo de vida digital:</p>

    <p><img src="img/gusanoconjunto.webp" align="left" width="120">No abra nunca archivos adjuntos extraños en el correo electr&oacute;nico: Si a&uacute;n no sigue esta regla de forma estricta, h&aacute;galo desde ahora. Abrir un correo electr&oacute;nico desconocido o inesperado, aunque provenga de alg&uacute;n conocido, rara vez conduce a algo bueno. Si recibe alguno, p&oacute;ngase en contacto con ellos y confirme que realmente ten&iacute;an la intenci&oacute;n de envi&aacute;rselo.</p>

    <p><img src="img/noclick.webp" align="left" width="120">No haga clic en enlaces extraños: Al igual que en el caso anterior, no lo haga. Algunos ciberdelincuentes pueden esconder los enlaces maliciosos hasta el punto de que ni siquiera al poner el cursor sobre ellos se delatan. Ning&uacute;n v&iacute;deo viral es tan divertido como para arriesgarse a ser infectado con malware. Ignore el enlace.</p>

    <p><img src="img/noutilice.webp" align="left" width="120">No utilice programas de P2P: Nunca puede estar completamente seguro de estar descargando los archivos que espera cuando usa una red de intercambio de archivos. Los archivos multimedia gratuitos son tentadores. Si no le queda m&aacute;s opci&oacute;n que piratear, investigue a fondo la fuente (y utilice una VPN).</p>

    <p><img src="img/noclikanuncio.webp" align="left" width="120">No haga clic en anuncios sospechosos: Algunos gusanos pueden infectar sitios web y propagarse a su equipo al hacer clic en anuncios contaminados. Puede eliminar estos y la mayor&iacute;a de los dem&aacute;s anuncios utilizando un software de bloqueo de anuncios, o mejor a&uacute;n, pruebe Avast Secure Browser. No solo es gratis, sino que ofrece toda una variedad de funciones de mejora de seguridad y privacidad, incluido un bloqueador de anuncios, para ofrecer una experiencia de navegaci&oacute;n m&aacute;s segura.</p>

    <p><img src="img/softwareact.webp" align="left" width="120">Use software actualizado: Los gusanos se aprovechan del software obsoleto para acceder a su equipo. Para contrarrestarlos, actualice su sistema operativo y otros programas tan pronto como est&eacute;n disponibles los parches de seguridad y las actualizaciones generales. No ganar&aacute; nada por esperar, excepto, posiblemente, un gusano inform&aacute;tico.</p>

    <p><img src="img/utilizarcontraseña.webp" align="left" width="120">Utilice contraseñas seguras y exclusivas: Algunos gusanos usan credenciales de inicio de sesi&oacute;n predeterminadas de f&aacute;brica para infectar diferentes dispositivos. Proteja su tel&eacute;fono, su equipo y cualquier otro dispositivo mediante contraseñas seguras que sean dif&iacute;ciles de adivinar, y no use la misma contraseña varias veces.</p>

    <br>
    <br>
        
    <h3 class="hh">#3. Troyanos.</h3>

    <br>
    <br>
        
    <p><img src="img/troyano.jpg" align="left" width="340" height="180" class="img-left">¿Recuerdas el Caballo de Troya en el que se ocultaron los griegos para entrar en la ciudad de los troyanos y derrotarlos? Pues el malware conocido como troyano hace lo mismo, ¡pero en tu ordenador! Un Caballo de Troya o troyano inform&aacute;tico habitualmente entra en tu equipo o tu dispositivo aprovechando la descarga de software leg&Iacute;timo. (Ojo a la descarga de programas, te recomiendo que lo descargues siempre desde el dominio oficial y cuidado con la palabra gratis en este contexto, casi siempre lleva algo escondido). De ah&Iacute; su nombre, porque el Caballo de Troya era supuestamente un inofensivo regalo de los griegos a los troyanos por su valor en la batalla. ¿Su objetivo? Abrir una puerta trasera a los hackers para que puedan controlar tu equipo y su software. A diferencia de virus y gusanos, el troyano no provoca daños ni se propaga. Por eso pasa inadvertido, algo importante para cumplir su funci&oacute;n.</p>

    <h3>¿Qu&eacute; es un troyano?</h3>

    <p>Un malware troyano es un archivo, programa o fragmento de c&oacute;digo que parece ser leg&iacute;timo y seguro, pero en realidad es malware. Los troyanos se empaquetan y entregan dentro de software leg&iacute;timo (de ahí su nombre), y suelen diseñarse para espiar a las v&iacute;ctimas o robar datos. Muchos troyanos tambi&eacute;n descargan malware adicional despu&eacute;s de instalarlos. El troyano obtiene su nombre del Caballo de Troya del poema &eacute;pico griego La Il&iacute;ada. En la historia, el h&eacute;roe griego Odiseo trama un plan para construir un caballo gigante de madera que sus enemigos, los troyanos, recibir&iacute;an en su ciudad como regalo. Sin embargo, en la barriga del caballo se escond&iacute;a una legi&oacute;n de soldados, que emergi&oacute; una vez ca&iacute;da la noche para diezmar la ciudad de Troya desde dentro. Los malware troyanos funcionan del mismo modo: simulan ser algo inofensivo, pero es solo una cubierta para su verdadera y maliciosa intenci&oacute;n.</p>

    <br>
    <br>
    <br>

    <center><img src="img/troyano2.webp"></center>

    <br>
    <br>
    <br>

    <h3>¿C&oacute;mo funcionan los troyanos?</h3>>
    
    <p>Los troyanos funcionan haci&eacute;ndose pasar por archivos leg&iacute;timos, con el objetivo de engañar a las v&iacute;ctimas para que hagan clic en ellos, los abran o los instalen. Cuando esto ocurre, el troyano comienza a instalar malware en el dispositivo, le esp&iacute;a o le causa otro tipo de daño. Por ejemplo, los troyanos de los correos electr&oacute;nicos utilizar&aacute;n t&eacute;cnicas de ingenier&iacute;a social para imitar los archivos adjuntos de correo electr&oacute;nico mundanos. El propio correo electr&oacute;nico parecer&aacute; de confianza, pero en realidad es un correo fraudulento enviado por un ciberdelincuente. Cuando abre el archivo adjunto, el troyano se activa y empieza a atacar su dispositivo. El engaño es una parte central de la definici&oacute;n de troyano.</p>

    <h3>¿Los troyanos son un virus o malware?</h3>
    
    <p>Los troyanos no son virus, sino que son un tipo de malware. En ocasiones, las personas se refieren a ellos como «virus troyanos», pero no lo son. Esto se debe a una diferencia fundamental en la forma en que los virus y los troyanos infectan a sus v&iacute;ctimas. Mientras que los virus se autorreplican y se propagan de una v&iacute;ctima a otra, los troyanos necesitan que los instale. Esa diferencia es lo que distingue a los virus del malware troyano. Por supuesto, tanto los virus como los troyanos son tipos de malware.</p>

    <br>
    <br>
    <br>

    <center><img src="img/malwarevirus.webp"></center>

    <br>
    <br>
    <br>

    <h3>C&oacute;mo reconocer un ataque troyano</h3>
    
    <p>Los programas troyanos son astutos, pero si sabe c&oacute;mo buscarlos, puede reconocer las señales de un ataque troyano y empezar el proceso de eliminaci&oacute;n de troyanos. Estas son las señales m&aacute;s comunes de un ataque de malware troyano:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20"> Su ordenador va lento</p>

    <p>Los troyanos suelen instalar otro malware que, en conjunto, puede consumir grandes cantidades de recursos inform&aacute;ticos. Elimine la infecci&oacute;n por troyanos para acelerar su PC u otro dispositivo.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20"> Bloqueo y congelaci&oacute;n del sistema</p>

    <p>A veces, los troyanos pueden saturar su ordenador y provocar bloqueos u otros fallos. La infame pantalla azul de la muerte es siempre un motivo de preocupaci&oacute;n.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20"> Aplicaciones desconocidas en el dispositivo</p>

    <p>Muchos troyanos instalan otro malware. Si ve algo que no conoce en el Administrador de tareas de Windows o el Monitor de Actividad de macOS, invest&iacute;guelo, puede que sea malware.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20"> Redirecciones de Internet</p>

    <p>Algunos troyanos cambian la configuraci&oacute;n DNS o manipulan el navegador para redirigirle a sitios maliciosos que pueden recopilar datos e infectarle con otro malware.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20"> Cambios en el escritorio, la barra de tareas o el navegador</p>

    <p>Dado que los troyanos instalan nuevo malware o hacen otros cambios en su ordenador, puede que vea iconos nuevos en el escritorio o la barra de tareas. Lo mismo ocurre con las barras de herramientas o complementos del navegador que no ha instalado. Busque estos secuestradores de navegador.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20"> M&aacute;s ventanas emergentes</p>

    <p>¿Ve m&aacute;s ventanas emergentes que de costumbre? Puede que se haya instalado un troyano adware en su dispositivo.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20"> El software antivirus est&aacute; desactivado</p>

    <p>Los troyanos y otro tipo de malware no quieren que los detecten y eliminen, as&iacute; que intentan desactivar el software antivirus. Prot&eacute;jase frente a troyanos y otro tipo de malware con una soluci&oacute;n antivirus gratis que los detenga antes de que causen daños.</p>

    <h3>Tipos de Troyanos</h3>

    <p class="subdivision"><img class="img-left" src="img/puertatrasera.png" width="50" align="left"> Troyanos de puerta trasera</p>
    
    <p>Los ciberdelincuentes utilizan troyanos de puerta trasera para abrirse paso «por detr&aacute;s» en el dispositivo, una forma de acceder al ordenador sin que lo sepa. Esta puerta trasera suele utilizarse para instalar m&aacute;s malware, espiarle y recopilar sus datos, o conectar el ordenador a una red de bots.</p>

    <p class="subdivision"><img class="img-left" src="img/bancarios.png" width="60" align="left">Troyanos bancarios</p>
    
    <p>Los troyanos bancarios se infiltran en los dispositivos y roban sus credenciales de inicio de sesi&oacute;n financieras. Los hackers los utilizan para descifrar sus cuentas bancarias y otras cuentas financieras. El troyano ZeuS, uno de los troyanos m&aacute;s infames hasta la fecha, era un troyano bancario.</p>

    <p class="subdivision"><img class="img-left" src="img/troyanoddos.png" width="60" align="left">Troyanos de DDoS</p>
    
    <p>Los troyanos de DDoS tienen como objetivo incluir el dispositivo en una red de bots: una red de dispositivos enlazados controlados de forma remota por un hacker conocido como bot herder. Utilizar&aacute;n la red de bots para llevar a cabo ataques distribuidos de denegaci&oacute;n de servicio (DDoS) que cierran otros sitios web y servicios de Internet.</p>

    <p class="subdivision"><img class="img-left" src="img/troyanodescargas}.png" width="60" align="left">Troyanos lanzadores o de descarga</p>
    
    <p>Los lanzadores son la primera etapa de una amenaza combinada: un paquete de malware de tres partes que incluye un lanzador, un cargador y otro malware (a menudo un rootkit). El troyano lanzador infecta el dispositivo y establece la fase para el cargador, que instala un rootkit que proporciona al hacker acceso al dispositivo. El resto de troyanos de descarga instalar&aacute;n otros tipos de malware.</p>

    <p class="subdivision"><img class="img-left" src="img/troyanoexploit.png" width="55" align="left">Troyanos exploit</p>
    
    <p>Estos retorcidos troyanos utilizan exploits, trucos de software diseñados para aprovechar una vulnerabilidad conocida de software o hardware, para infectar su dispositivo. Los exploits de d&iacute;a cero se centran en las vulnerabilidades que solo el creador del exploit ha descubierto.</p>

    <p class="subdivision"><img class="img-left" src="img/troyanoantivirus.png" width="55" align="left">Troyanos antivirus falsos</p>
    
    <p>Un tipo peligroso de scareware, los troyanos antivirus falsos, simulan detectar virus y otro malware en el dispositivo y le incitan a pagar por un software de seguridad, que es in&uacute;til o activamente malicioso. Cuando paga, el creador del troyano obtiene su informaci&oacute;n de pago.</p>

    <p class="subdivision"><img class="img-left" src="img/troyanojuegos.png" width="60" align="left">Troyanos-ladrones de juegos</p>
    
    <p>Los troyanos-ladrones de juegos se dirigen a los jugadores en l&iacute;nea y les roban la informaci&oacute;n de inicio de sesi&oacute;n. Los ciberdelincuentes pueden utilizarlos para descifrar las cuentas de jugadores de perfil alto o robar art&iacute;culos valiosos dentro del juego.</p>

    <p class="subdivision"><img class="img-left" src="img/troyanoinfo.png" width="55" align="left">Troyanos infostealer</p>
    
    <p>El objetivo de los troyanos infostealer es robar datos. Revisar&aacute;n el dispositivo en busca de datos personales confidenciales y luego se los enviar&aacute;n al hacker que le atac&oacute;. Los ciberdelincuentes pueden utilizar estos datos para cometer fraude o robarle la identidad.</p>

    <p class="subdivision"><img class="img-left" src="img/troyanoim.png" width="50" align="left">Troyanos IM (de mensajer&iacute;a instant&aacute;nea)</p>
    
    <p>Los troyanos IM, que se dirigen a las aplicaciones de mensajer&iacute;a instant&aacute;nea (IM) del dispositivo, roban sus credenciales de inicio de sesi&oacute;n para acceder a su lista de contactos. Las aplicaciones de mensajer&iacute;a instant&aacute;nea m&aacute;s modernas que utilizan cifrado, como WhatsApp o Signal, son menos vulnerables que los servicios m&aacute;s antiguos, como Skype o MSN Messenger, pero el malware evoluciona constantemente.</p>

    <p class="subdivision"><img class="img-left" src="img/troyanomail.png" width="50" align="left">Troyanos mailfinder</p>
    
    <p>Los troyanos mailfinder, menos peligrosos en la era de los servicios de correo electr&oacute;nico como Gmail, se centran en las aplicaciones de correo como Microsoft Office y las sondean para buscar direcciones de correo electr&oacute;nico. Los ciberdelincuentes pueden añadir las direcciones de correo electr&oacute;nico robadas a sus ataques de spam o phishing.</p>

    <p class="subdivision"><img class="img-left" src="img/troyanoransom.png" width="54" align="left">Troyanos ransomware</p>
    
    <p>El ransomware es un tipo de malware que bloquea el acceso a sus datos o dispositivos y amenaza con publicarlos, retenerlos de forma permanente o destruirlos a menos que pague un rescate. Los troyanos ransomware engañan a las v&iacute;ctimas para que activen el ransomware.</p>

    <p class="subdivision"><img class="img-left" src="img/troyanosms.png" width="45" align="left">Troyanos SMS</p>
    
    <p>Los troyanos SMS infectan los dispositivos m&oacute;viles, normalmente Android, y env&iacute;an mensajes caros a servicios pr&eacute;mium que son propiedad del ciberdelincuente o interceptan los mensajes que entran y salen del tel&eacute;fono.</p>

    <h3>Ejemplos de ataques de troyanos</h3>
    
    <p>El malware troyano ha causado algunos de los ciberataques m&aacute;s famosos de la historia. A continuaci&oacute;n, le mostramos algunos de los troyanos m&aacute;s conocidos.</p>

    <p class="subdivision">ZeuS</p>
    
    <p>El troyano ZeuS apareci&oacute; por primera vez en 2007 en un ataque para robar datos al Departamento de Transporte de los Estados Unidos. Conocido principalmente como un troyano bancario, ZeuS suele utilizarse para robar informaci&oacute;n financiera a trav&eacute;s de dos t&eacute;cnicas basadas en el navegador:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Registro de pulsaciones de teclas: el troyano registra las pulsaciones de teclas a medida que introduce informaci&oacute;n en el navegador.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Apropiaci&oacute;n de formularios: ZeuS puede interceptar su nombre de usuario y contraseña cuando inicia sesi&oacute;n en un sitio web.</p>

    <p>Al difundirse ampliamente a trav&eacute;s de correos electr&oacute;nicos de phishing y descargas autom&aacute;ticas no autorizadas en sitios web, ZeuS posiblemente infect&oacute; a millones de ordenadores. Por eso se utiliz&oacute; para crear Gameover ZeuS, una de las redes de bots m&aacute;s famosas de todos los tiempos.</p>

    <p class="subdivision">Emotet</p>

    <p>Detectado por primera vez en 2014, Emotet empez&oacute; como un troyano bancario. Sin embargo, cuando los cibercriminales comenzaron a usarlo para distribuir otro malware en su lugar, Emotet caus&oacute; serias avalanchas en ciberseguridad. Emotet, aclamado sistem&aacute;ticamente como una de las cepas de malware m&aacute;s dañinas jam&aacute;s creadas, se centraba en v&iacute;ctimas corporativas e individuales por igual a trav&eacute;s de campañas masivas de spam y de phishing. El malware se utiliz&oacute; para crear varias redes de bots que luego se alquilaron en un modelo de malware como servicio (MaaS) a otros ciberdelincuentes emprendedores.</p>
        
    <p>Emotet se detuvo finalmente en 2021 a trav&eacute;s de un esfuerzo global coordinado de aplicaci&oacute;n de la ley.</p>

    <p class="subdivision">Shedun</p>

    <p>Los troyanos no son solo para Windows. Shedun es un troyano adware para Android que vuelve a empaquetar aplicaciones leg&iacute;timas para Android con adware falso antes de volver a alojarlas en portales de descarga externos. Cuando instala la aplicaci&oacute;n desde uno de estos sitios, se descarga tambi&eacute;n el adware. Una vez que instala la aplicaci&oacute;n infectada, recibe spam con anuncios que generan ingresos para el atacante. Eliminar el malware de su dispositivo Android es muy dif&iacute;cil, y la mayor&iacute;a de las v&iacute;ctimas optan por comprar nuevos dispositivos. En 2016, se inform&oacute; de que Shedun hab&iacute;a infectado a m&aacute;s de 10 millones de dispositivos Android.</p>

    <h3>¿Pueden afectar los troyanos a los dispositivos m&oacute;viles?</h3>

    <p>Los troyanos pueden afectar a los dispositivos m&oacute;viles del mismo modo que lo hacen a los ordenadores de escritorio y port&aacute;tiles. Tanto Android como iOS han sido infectados por malware troyanos, aunque es mucho m&aacute;s com&uacute;n encontrarlos en Android. El troyano GriftHorse es un reciente troyano SMS para Android que registra a las v&iacute;ctimas en servicios de mensajer&iacute;a pr&eacute;mium para generar ingresos para el atacante. Hasta ahora ha afectado a m&aacute;s de 10 millones de v&iacute;ctimas en todo el mundo. GriftHorse se disfraza de aplicaciones leg&iacute;timas, de las cuales la m&aacute;s popular tiene m&aacute;s de 500 000 descargas.</p>

    <p>En 2016, se vio que el troyano AceDeceiver para iOS era capaz de atacar a dispositivos iOS sin jailbreak. Tres aplicaciones independientes de AceDeceiver superaron los procesos de revisi&oacute;n internos de Apple y estaban disponibles para descargar en la App Store oficial.</p>

    <h3>C&oacute;mo evitar ataques de troyanos</h3>

    <p class="subdivision">1. Descargue aplicaciones y software de fuentes oficiales.</p>

    <p>Los troyanos suelen alojarse en sitios de descarga de aplicaciones de terceros. Obtenga el software directamente del fabricante o de portales oficiales como la App Store de Apple y Google Play. Aunque tambi&eacute;n han estado amenazados por troyanos en el pasado, son mucho m&aacute;s seguros que otras opciones.</p>

    <p class="subdivision">2. No abra archivos adjuntos de correos electr&oacute;nicos desconocidos ni haga clic en enlaces extraños.</p>

    <p>Los correos electr&oacute;nicos fraudulentos son un vector popular para propagar troyanos. No haga clic en archivos adjuntos ni enlaces de correos electr&oacute;nicos que no espera recibir. Incluso si el correo electr&oacute;nico parece leg&iacute;timo, puede que lo haya falsificado un ciberdelincuente.</p>

    <p class="subdivision">3. Utilice un bloqueador de anuncios o un navegador seguro.</p>

    <p>Algunos troyanos se propagan a trav&eacute;s de anuncios web infectados. Un bloqueador de anuncios o navegador privado evitar&aacute; que estos y otros anuncios se carguen en el navegador, lo que impedir&aacute; que los sitios infectados le proporcionen un troyano. Avast Secure Browser es un navegador altamente seguro que bloquea anuncios autom&aacute;ticamente y le protege frente a descargas maliciosas.</p>

    <p class="subdivision">4. No conf&iacute;e en el software gratuito.</p>

    <p>Los creadores de troyanos suelen camuflarlos como juegos gratis y otras aplicaciones que parecen &uacute;tiles. Si est&aacute; a punto de instalar algo nuevo, invest&iacute;guelo primero y lea las opiniones de los usuarios.</p>

    <p class="subdivision">5. No haga clic en anuncios web o enlaces que no conozca.</p>

    <p>No todas las descargas ocultas se gestionan con anuncios maliciosos. Algunos creadores de malware desarrollan sitios web que pueden instalar autom&aacute;ticamente troyanos y otro malware en los dispositivos en cuanto los visita. Evitar sitios desconocidos reduce el riesgo de descargar un troyano.</p>

    <p class="subdivision">6. Utilice una herramienta antivirus.</p>

    <p>Una herramienta antivirus potente de un proveedor respetable mantendr&aacute; a los troyanos lejos de su dispositivo autom&aacute;ticamente. Elija una que funcione como una herramienta de eliminaci&oacute;n de malware y que tambi&eacute;n pueda detectar y eliminar troyanos y otro malware de los dispositivos.</p>

    <br>
    <br>

    <h3 class="hh">#4. Adware.</h3>

    <br>
    <br>
    
    <p><img src="img/addware.png" align="right" width="300" height="250" class="img-right">Otro campe&oacute;n de popularidad entre los usuarios. Y es que los efectos de un adware no pasan inadvertidos. ¿Qui&eacute;n no ha sufrido las molestias de navegar por Internet envuelto en un mar de anuncios spam y ventanas emergentes que se abren en el navegador de forma descontrolada? El adware es un tipo de software aparentemente inofensivo si se compara con alguno de los anteriores tipos de malware, pero que puede bajar dr&aacute;sticamente el rendimiento de los trabajadores que necesitan navegar por Internet para realizar sus tareas. A veces el adware incluye un “antivirus” o cualquier otra opci&oacute;n de registro mediante pago que elimina el problema. Se trata de un engaño perpetrado por los mismos autores del adware a erradicar. Hace tiempo localic&eacute; un limpiador para este software que utilizamos desde hace tiempo y este si es gratuito, eso s&iacute; te recomiendo que lo hagas con un t&eacute;cnico especializado, alguna vez que otra borra alg&uacute;n servicio si tocas o activas alguna opci&oacute;n que no debes activar. Se llama adwcleaner.</p>

    <h3>¿Qu&eacute; es el adware?</h3>

    <p>¡¡¡ENHORABUENA!!! ¡¡¡HA SIDO SELECCIONADO PARA GANAR UN IPHONE GRATIS!!!</p>
    
    <p>---> ¡¡¡HAGA CLIC AQU&Iacute;!!! <---</p>

    <p>¿Alguna vez ha estado navegando por Internet tranquilamente cuando, de repente, empiezan a inundarlo estos mensajes? Si supuso que se trataba de spam, ¡acert&oacute;! Si ve muchos anuncios de este tipo, es probable que tenga en su sistema un tipo particular de software malicioso (malware) denominado adware. Definir el adware es f&aacute;cil: se trata de un software que secuestra su navegador u otras partes del sistema para inundarlo con anuncios no deseados. Existen tres tipos distintos de adware. Algunos son programas gratuitos patrocinados con publicidad que hacen aparecer anuncios en ventanas emergentes o en una barra de herramientas del sistema operativo o el navegador. Puede tratarse de software leg&iacute;timo, solo que con algunos (y molestos) anuncios. En su nivel m&aacute;s extremo, el adware es un malware que puede recabar su informaci&oacute;n personal realizando un seguimiento de los sitios web que visita o registrando las teclas que pulsa. Este aspecto del adware es muy similar al spyware, un software esp&iacute;a malicioso.</p>

    <p>El fin del adware es generar ingresos para su propietario, que gana dinero cada vez que usted hace clic en uno de los anuncios mostrados. Como el adware hace un seguimiento de su navegaci&oacute;n, puede presentarle anuncios dirigidos y adaptados a sus intereses. Tambi&eacute;n puede vender sus datos de navegaci&oacute;n a terceros. Adem&aacute;s, no se detiene si cambia de navegador: el adware reside en el propio sistema operativo, por lo que los anuncios seguir&aacute;n ah&iacute;, no importa la aplicaci&oacute;n que utilice para navegar. Hay que aclarar que puede ver montones de anuncios sospechosos en l&iacute;nea que no son necesariamente adware. El adware reside en el sistema y muestra anuncios desde el interior. Especialmente en sitios turbios, como por ejemplo una plataforma ilegal de streaming, puede ver muchos anuncios sospechosos que no son adware. Es probable que hacer clic en estos anuncios conduzca a la descarga de malware u otros problemas. Por tanto, aunque no se trate de adware, siempre conviene evitar los anuncios en l&iacute;nea de fuentes sospechosas. (Si ve una oferta que le llama la atenci&oacute;n, es mejor hacer una b&uacute;squeda en Google para comprobar si es real. No haga clic en el anuncio en s&iacute;).</p>

    <h3>¿C&oacute;mo se propaga el adware?</h3>

    <p>Hay un par de maneras de infectarse con adware. Un mecanismo de infecci&oacute;n es la descarga de programas o aplicaciones “gratuitas” que, sin su conocimiento ni su consentimiento, se acompañan de adware. Esta situaci&oacute;n se da cuando el desarrollador del programa colabora con el proveedor del adware para as&iacute; obtener ingresos por su aplicaci&oacute;n “gratuita”. Estas aplicaciones no deseadas se denominan junkware. Pueden incluso venir preinstaladas en el equipo, obstruir su m&aacute;quina y comprometer su seguridad. Afortunadamente, el junkware se puede eliminar.</p>

    <p>La otra forma m&aacute;s com&uacute;n de infectarse con adware es que un programador malicioso halle en un navegador una vulnerabilidad que pueda aprovechar. Las vulnerabilidades se crean de forma accidental durante el proceso de desarrollo y los fabricantes publican con frecuencia actualizaciones para parchear estos boquetes en la seguridad. Sin embargo, si todav&iacute;a no existe un parche o el usuario no aplica una actualizaci&oacute;n, los hackers pueden dar con un modo de colarse en su dispositivo. En el caso del adware, suelen hacerlo mediante descargas de paso, que se producen cuando se visita un sitio web infectado que descarga secretamente software en el sistema.</p>
    
    <h3>¿El adware es un virus?</h3>

    <p>En realidad, no. Aunque muchos utilizan el t&eacute;rmino “virus” para referirse a cualquier software dañino, el adware no encaja de forma precisa en la definici&oacute;n de virus inform&aacute;tico: c&oacute;digo malicioso que secuestra otros programas para autorreplicarse y propagarse a nuevos anfitriones a trav&eacute;s de redes. El adware es, m&aacute;s bien, un tipo distinto de malware. Hay muchos tipos distintos de malware, como el ransomware, el spyware y los troyanos.</p>

    <h3>¿Qui&eacute;n est&aacute; amenazado por el adware?</h3>

    <p>Los usuarios individuales tienen mayor riesgo de contraer adware que las empresas, y casi cualquier dispositivo puede verse afectado. Aquellos con menos conocimientos de Internet suelen ser los m&aacute;s expuestos, ya que es m&aacute;s probable que caigan en trucos habituales de los hackers, como las ofertas irresistibles. Pero, en esencia, cualquiera que navegue por Internet regularmente corre riesgo de contraer este molesto tipo de software malicioso. (Si quiere una lista completa de consejos para evitar el adware, la tiene m&aacute;s adelante). Aunque algunas personas creen que el malware solo supone una amenaza para los PC, se trata de un mito. El malware, y espec&iacute;ficamente el adware, afecta tambi&eacute;n a los Mac y los dispositivos m&oacute;viles. Por ejemplo, en 2017, Avast bloque&oacute; 250 millones de amenazas de malware dirigidas contra Mac, de las cuales 41 millones correspond&iacute;an a adware.</p>

    <br>
    <br>
    <br>

    <center><img src="img/addware2.webp"></center>

    <br>
    <br>
    <br>

    <h3>El adware y los dispositivos m&oacute;viles</h3>

    <p>Los dispositivos Android son m&aacute;s susceptibles al malware que los iPhone porque iOS cuenta con una potente seguridad integrada y un mejor sistema de actualizaciones. Sin embargo, los iPhone son vulnerables si se los somete a “jailbreak”, una operaci&oacute;n por la cual se anulan esas protecciones con el fin de instalar software no aprobado de terceros. El adware, en particular, se ha abierto camino con fuerza entre dispositivos m&oacute;viles como tel&eacute;fonos y tabletas. En 2015, Avast descubri&oacute; una serie de aplicaciones de adware enmascaradas como juegos que permanecieron en Google Play Store el tiempo suficiente como para que los usuarios desprevenidos las descargaran 10 millones de veces.</p>

    <p>Las aplicaciones en cuesti&oacute;n (un juego falso llamado Durak, as&iacute; como falsos test de inteligencia y cuestionarios de historia) solo revelan su aut&eacute;ntica naturaleza tras estar 30 días en el dispositivo (para que no resulte sencillo averiguar cu&aacute;l es el origen del problema). Pasado ese tiempo, empiezan a aparecer mensajes emergentes sobre falsos problemas en el dispositivo. Si el usuario hace clic en la pantalla para obtener m&aacute;s informaci&oacute;n o arreglar el problema, se le redirige a sitios web infectados que intentan enviarle mensajes de texto premium (que tienen un coste econ&oacute;mico), o que registran y venden sus h&aacute;bitos de navegaci&oacute;n.</p>

    <p>La pesadilla del adware no termina aqu&iacute;.</p>

    <p>En 2018, Avast descubri&oacute; 26 aplicaciones maliciosas en Google Play Store que conten&iacute;an adware agresivo. Estos programas, camuflados como aplicaciones de estilo de vida, meteorolog&iacute;a o criptomoneda, se retiraron tras nuestra denuncia. En 2019, Google Play Store tuvo que eliminar otras 85 aplicaciones falsas que conten&iacute;an adware, pero lo hizo tras haber sido descargadas 9 millones de veces. La m&aacute;s popular de todas, “Easy Universal TV Remote”, tuvo ella sola m&aacute;s de 5 millones de descargas. Solo seis meses despu&eacute;s, se eliminaron otras 238 aplicaciones que conten&iacute;an “adware avanzado, diseñado para evadir los sistemas de control de Google”, aunque para entonces ya hab&iacute;an sumado 440 millones de descargas.</p>
        
    <p>En resumen: tenga el dispositivo que tenga, debe protegerse del malware.</p>

    <h3>¿Qu&eacute; hace el adware?</h3>

    <p>Cada tipo de adware tiene caracter&iacute;sticas y comportamientos maliciosos propios: unos bombardean con anuncios, otros descargan complementos o aplicaciones no solicitados, otros rastrean su actividad en Internet e informan a su propietario para vender esa informaci&oacute;n a terceros. Aunque el adware puede ser poco agresivo en comparaci&oacute;n con otros tipos de malware, como el ransomware, s&iacute; puede resultar bastante molesto. Alg&uacute;n adware act&uacute;a incluso como un ataque de tipo “man-in-the-middle” y redirige todo el tr&aacute;fico del usuario a trav&eacute;s de su propio sistema, incluso en conexiones HTTPS (que deber&iacute;an ser seguras). Resulta alarmante cuando se considera que este comportamiento podr&iacute;a dejar expuestas sus compras y su actividad de banca en l&iacute;nea ante el desarrollador del adware.</p>

    <p>Adem&aacute;s, el adware consume capacidad de procesamiento. La descarga y ejecuci&oacute;n de anuncios sobrecarga el dispositivo y lo ralentiza. Y si el dispositivo afectado es móvil, toda esa publicidad supondr&aacute; un gasto adicional de datos.</p>

    <h3>¿Es ilegal el adware?</h3>

    <p>S&iacute; y no. Ofrecer software gratuito que viene empaquetado con anuncios no es ilegal en s&iacute; mismo. Sí lo es descargar sin su consentimiento software peligroso que nadie ha pedido, as&iacute; como rastrear su actividad en secreto y comunicar a otros su historial de navegaci&oacute;n. El que una cepa particular de adware sea o no ilegal es en cierto modo superfluo: en cualquier caso, es molesto, intrusivo y perjudicial para el rendimiento del equipo, por lo que siempre conviene librarse de &eacute;l.</p>

    <h3>¿C&oacute;mo saber si tiene adware?</h3>

    <p>¡Anuncios, anuncios y m&aacute;s anuncios! El m&aacute;s claro indicador de la presencia de adware es, por supuesto, un mont&oacute;n de publicidad que aparece en cuanto se intenta navegar por Internet o hacer otras tareas. Estos son otros s&iacute;ntomas que permiten diagnosticar una infecci&oacute;n con adware:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">El navegador tiene un aspecto distinto, con otra p&aacute;gina de inicio, una nueva barra de tareas o un nuevo complemento o extensi&oacute;n que usted no ha instalado.</p>
    
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Aparecen nuevas aplicaciones o programas que usted no ha descargado.</p>
    
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">El navegador funciona mucho m&aacute;s lento de lo habitual y se bloquea con frecuencia.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Los sitios que suele visitar tienen un aspecto distinto, o se le redirige a p&aacute;ginas extrañas cuando intenta navegar.</p>

    <br>
    <br>
    <br>

    <center><img src="img/addware3.webp"></center>

    <br>
    <br>
    <br>

    <p>Si identifica cualquiera de las señales anteriores en su dispositivo, lo m&aacute;s probable es que sufra alguna forma de malware. Muchos tipos de malware presentan s&iacute;ntomas similares, por lo que puede resultar dif&iacute;cil identificar el tipo preciso de software malicioso que le afecta. Si adem&aacute;s de las señales anteriores ve un mont&oacute;n de anuncios, hay muchas posibilidades de que sufra una infecci&oacute;n con adware.</p>

    <h3>Qu&eacute; hago si me infecto</h3>

    <p>Una vez que sospeche que hay adware en su dispositivo, deber&iacute;a analizarlo con una aplicaci&oacute;n anti-adware o anti-malware para diagnosticar el problema. Si se detecta adware, necesitar&aacute; una buena herramienta de eliminaci&oacute;n de adware que limpie la infecci&oacute;n y devuelva la normalidad a su dispositivo.</p>

    <h3>C&oacute;mo prevenir la propagaci&oacute;n de adware</h3>

    <p>Como sucede con todos los tipos de malware, es más f&aacute;cil prevenirlo que eliminarlo. Puede tomar distintas medidas para prevenir la propagaci&oacute;n de adware.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Utilice un bloqueador de publicidad fiable: Un bloqueador de publicidad previene los anuncios mientras navega, lo que puede eliminar las descargas de paso desde sitios web infectados.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">No haga clic en anuncios que parezcan demasiado buenos para creerlos: Cualquier anuncio que le ofrezca un iPhone gratis o algo aparentemente incre&iacute;ble es, muy probablemente, una estafa.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Ignore las falsas advertencias: Del mismo modo, los mensajes emergentes parpadeantes y llenos de signos de exclamaci&oacute;n que le avisan de un virus son, con toda probabilidad, falsos.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Evitar sitios web sospechosos: Aseg&uacute;rese de evitar los sitios web ileg&iacute;timos, especialmente si realiza compras en l&iacute;nea.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Ajuste la configuraci&oacute;n de privacidad de su navegador: Dependiendo del navegador que utilice, deber&iacute;a poder prevenir que terceros instalen sin su consentimiento elementos como barras de tareas.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Utilice un programa antivirus potente: Aunque siga todas estas recomendaciones, un malware testarudo puede lograr abrirse paso. Un robusto programa antivirus como Avast Free Antivirus es la mejor l&iacute;nea de defensa para impedir el paso de cualquier software malicioso.</p>

    <br>
    <br>
 
    <h3 class="hh">#5. Rootkit.</h3>

    <br>
    <br>
    
    <p><img src="img/rootkit.png" align="left" width="150" height="125" class="img-left">Es un software que permite a los ciber intrusos acceder a equipos sin ser detectados para robar informaci&oacute;n sensible. Los Rootkits permiten acceso privilegiado a un usuario (el hacker), que se conecta de forma remota, alterando el sistema operativo para ocultar la maniobra. <br>Un aut&eacute;ntico riesgo para empresas y usuarios, que pueden ver sustra&iacute;das sus claves de acceso, datos bancarios, etc.</p>

    <h3>¿Qu&eacute; es un rootkit?</h3>

    <p>Un rootkit es un paquete de software malicioso diseñado para permitir el acceso no autorizado a un equipo o a otro software. Los rootkits son dif&iacute;ciles de detectar y pueden ocultar su presencia en un sistema infectado. Los hackers usan este tipo de malware para acceder de forma remota a su equipo, manipularlo y robar datos. Cuando un rootkit se arraiga en el sistema, este se comporta como un equipo zombi y el hacker puede usar el acceso remoto para ejercer un control absoluto de su dispositivo. Esta parte de la definici&oacute;n de rootkit es la que les otorga tanto poder. De la misma manera que el malware sin archivos usa programas leg&iacute;timos sin dejar rastro, los rootkits tambi&eacute;n pueden parecer leg&iacute;timos, porque el hacker tiene acceso con privilegios a los archivos y procesos del sistema. Los rootkits hacen que su equipo le mienta a usted y, a veces, tambi&eacute;n al antivirus y al software de seguridad.</p>

    <h3>¿Qu&eacute; hace un rootkit?</h3>

    <p>Los rootkits permiten que el c&oacute;digo malicioso se esconda en su dispositivo. Cuando un rootkit ataca su equipo, autoriza el acceso remoto de administrador a su sistema operativo, a la vez que evita ser detectado.</p>
        
    <p class="subdivision">¿Qu&eacute; modifica un rootkit?</p>
        
    <p>Como la finalidad de un rootkit es conseguir un acceso privilegiado y a nivel de administrador al sistema de su equipo, un rootkit puede realizar las mismas modificaciones que un administrador. A continuaci&oacute;n, se muestra una breve lista de lo que puede hacer o modificar un rootkit.</p>

    <p><img class="img-left" src="img/ocultarmal.png" width="70" align="left">Ocultar malware: Los rootkits esconden otros tipos de malware en su dispositivo y dificultan su eliminaci&oacute;n.</p>

    <p><img class="img-left" src="img/accesoremoto.png" width="70" align="left">Obtener acceso remoto: Los rootkits proporcionan acceso remoto a su sistema operativo, a la vez que evitan ser detectados. Las instalaciones de rootkits se asocian cada vez m&aacute;s a las estafas de acceso remoto.</p>

    <p><img class="img-left" src="img/manipular.png" width="70" align="left">Manipular o desactivar programas de seguridad: Algunos rootkits pueden ocultarse ante los programas de seguridad de su equipo o apagarlos del todo, por lo que dificultan la detecci&oacute;n y eliminaci&oacute;n del malware.</p>

    <p><img class="img-left" src="img/robardatos.png" width="70" align="left">Robar datos: La mayor&iacute;a de las veces, los ciberdelincuentes utilizan rootkits para robar datos. Algunos hackers atacan a personas y recaban datos personales para cometer robo de identidad o fraude. Otros van a por empresas, ya sea para espiarlas o para cometer delitos financieros.</p>

    <p><img class="img-left" src="img/puertatrasera.png" width="70" align="left">Crear una «puerta trasera» permanente: Algunos rootkits pueden crear en su sistema una puerta trasera de ciberseguridad que queda abierta para que el hacker pueda regresar m&aacute;s adelante.</p>

    <p><img class="img-left" src="img/espiarle.png" width="70" align="left">Espiarle: Los rootkits pueden usarse como herramientas de seguimiento que permiten que los hackers le esp&iacute;en.</p>

    <p><img class="img-left" src="img/invadirpriva.png" width="70" align="left">Invadir su privacidad: Con un rootkit, un hacker puede interceptar su tr&aacute;fico de Internet, registrar las teclas que pulsa e incluso leer su correo electr&oacute;nico.</p>

    <h3>C&oacute;mo eliminar un rootkit</h3>

    <p>No es f&aacute;cil eliminar un rootkit. Como se ocultan en lo m&aacute;s profundo de su sistema operativo, su presencia es dif&iacute;cil de detectar. Sin embargo, cuando sabe que tiene uno, curar la infecci&oacute;n rootkit de su equipo zombi es de vital importancia.</p>

    <p class="subdivision">Paso 1: Ejecutar un software de eliminaci&oacute;n de rootkits</p>

    <p>No conf&iacute;e en Windows Defender o en otro software de seguridad integrado, ya que la mayor&iacute;a de los rootkits pueden subvertir las protecciones b&aacute;sicas. Para obtener una protecci&oacute;n completa, use software especializado.</p>

    <p class="subdivision">Paso 2: Realizar un an&aacute;lisis al arranque</p>

    <p>El malware moderno usa t&eacute;cnicas sofisticadas para evitar ser detectado por los productos de antivirus. Una vez que se ejecuta el sistema operativo, los rootkits presentes en el dispositivo pueden burlar los an&aacute;lisis autom&aacute;ticos del antivirus. Si un antivirus le solicita al sistema operativo que abra un archivo de malware en concreto, el rootkit puede cambiar el flujo de informaci&oacute;n y abrir un archivo inofensivo en su lugar. Tambi&eacute;n pueden cambiar el c&oacute;digo de enumeraci&oacute;n de un archivo de malware, utilizado para almacenar y compartir informaci&oacute;n sobre el malware, lo que evitar&iacute;a que se incluyera en un an&aacute;lisis. </p>

    <p>Es por eso que un an&aacute;lisis al arranque, es tan &uacute;til. Los an&aacute;lisis al arranque se ejecutan durante el proceso de inicio de su equipo y atrapan a los rootkits antes de que act&uacute;en. La ventaja del an&aacute;lisis al arranque es que normalmente el rootkit se encontrar&aacute; a&uacute;n en un estado inactivo y no podr&aacute; ocultarse en su sistema.</p>

    <p class="subdivision">Paso 3: Borrar el dispositivo y reinstalar el sistema operativo</p>
    
    <p>Si el antivirus y el an&aacute;lisis al arranque no son capaces de eliminar el rootkit, intente hacer una copia de seguridad de sus datos, borrar su dispositivo y realizar una instalaci&oacute;n limpia. A veces esta es la &uacute;nica soluci&oacute;n cuando el rootkit opera a nivel de arranque, firmware o hipervisor. Para empezar, debe saber c&oacute;mo formatear un disco duro y clonar un disco duro para hacer una copia de seguridad de sus archivos importantes. Es posible que deba borrar el disco C: principal, pero a&uacute;n puede conservar la mayor&iacute;a de sus datos. Este es el &uacute;ltimo recurso para eliminar un rootkit.</p>

    <h3>Evitar la llegada de los rootkits</h3>
    
    <p>El mejor m&eacute;todo para eliminar un virus rootkit es evitar tener que eliminarlo. Hay acciones que puede realizar ahora mismo para evitar la temida pregunta de c&oacute;mo eliminar un rootkit. Practique h&aacute;bitos inteligentes de seguridad en l&iacute;nea y estar&aacute; mucho m&aacute;s cerca de mantenerse libre de rootkits.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Recele de los archivos desconocidos: Deber&iacute;a revisar con atenci&oacute;n incluso los archivos que le env&iacute;an los contactos de confianza antes de abrirlos. Nunca abra los archivos adjuntos de remitentes desconocidos, podr&iacute;an ser ataques de phishing.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Obtenga el software de fuentes reputadas: Lo ideal es obtenerlo directamente del fabricante o desde las tiendas App Store o Google Play. Examine atentamente los t&eacute;rminos y condiciones para asegurarse de que nadie intenta colarle un rootkit en el dispositivo.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Instale las actualizaciones del sistema de inmediato: Estas actualizaciones suelen parchear vulnerabilidades descubiertas recientemente que los hackers pueden aprovechar para colarse en su dispositivo.</p>

    <h3>C&oacute;mo identificar y encontrar rootkits</h3>

    <p>Cuando un rootkit hace su trabajo adecuadamente, usted ni se da cuenta. La mejor manera de encontrar y detectar rootkits es con una herramienta de an&aacute;lisis y eliminaci&oacute;n de rootkits. Para los que prefieren hacerlo ellos mismos, tenemos consejos alternativos sobre c&oacute;mo encontrar un rootkit. No ser&aacute; tan f&aacute;cil como escoger el mejor software de antivirus gratuito y, aunque encuentre el rootkit usted mismo, es posible que no pueda eliminarlo, pero estamos aqu&iacute; para ayudarle.</p>

    <h3>Señales de un ataque de rootkit</h3>

    <p>Las siguientes señales de alerta pueden indicar la presencia de un rootkit en su dispositivo:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Su sistema act&uacute;a de forma extraña: Los rootkits permiten a los hackers manipular el sistema operativo de su equipo. Si su equipo act&uacute;a de forma extraña, es posible que sea obra de un hacker a trav&eacute;s de un rootkit.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Cambio en la configuraci&oacute;n: En general, su equipo no deber&iacute;a hacer cosas sin que se lo digan, y lo ideal es que sea usted quien decida lo que hace. El acceso remoto mediante un rootkit puede permitir a alguien trastear en sus ajustes y configuraciones. Si algo parece diferente, tal vez deba preocuparse.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Intermitencia en p&aacute;ginas web y actividades de red: Si su conexi&oacute;n a Internet empieza a fallar m&aacute;s de lo habitual, tal vez sea algo peor que un problema en el servicio. Si un hacker est&aacute; utilizando un rootkit para enviar o recibir mucho tr&aacute;fico desde su equipo, su conexi&oacute;n a Internet podr&iacute;a verse afectada.</p>

    <h3>C&oacute;mo encontrar un rootkit</h3>

    <p>Si sospecha que su equipo se ha infectado, las siguientes t&eacute;cnicas podr&iacute;an ayudarle a encontrar el rootkit:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">An&aacute;lisis de firmas: Los ordenadores act&uacute;an con n&uacute;meros. La firma de un software es el conjunto de n&uacute;meros que sirve como su representaci&oacute;n, en argot inform&aacute;tico. Puede analizar su equipo con una base de datos de firmas de rootkits conocidos para comprobar si se encuentra alguna de ellas.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">An&aacute;lisis del volcado de memoria: Cuando un equipo Windows se bloquea, genera un archivo llamado volcado de memoria o volcado de bloqueo. Un t&eacute;cnico experimentado puede examinar este archivo para identificar el origen del bloqueo y ver si fue causado por un rootkit.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">B&uacute;squeda en la memoria del sistema: Rebusque entre la memoria del sistema de su equipo para ver si hay algo extraño. Compruebe todos los puntos de entrada (acceso) en busca de señales de llamadas a procesos y rastree todas las llamadas a bibliotecas importadas desde las bibliotecas de v&iacute;nculos din&aacute;micos (DLL, por sus siglas en ingl&eacute;s). Algunas pueden estar enganchadas o redirigidas a otras funciones.</p>

    <h3>¿C&oacute;mo se instalan los rootkits?</h3>

    <p>A diferencia de los gusanos inform&aacute;ticos y los virus, pero de una forma similar al malware de tipo troyano, las infecciones rootkit necesitan ayuda para instalarse en su equipo.</p>

    <p>Los hackers empaquetan los rootkits junto con dos programas asociados, el dropper y el loader, que colaboran para instalar el rootkit. Estos tres elementos de malware componen una amenaza combinada. Vamos a analizar con m&aacute;s detalle las herramientas utilizadas por los rootkits para instalarse:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Dropper: El «dropper» importa el rootkit en el equipo de la v&iacute;ctima. El dropper es la primera fase en el proceso de instalaci&oacute;n. Una vez que la v&iacute;ctima lo activa, el «dropper» activa a su vez el «loader».</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Loader: Cuando el dropper se ejecuta, el loader salta a la acci&oacute;n e instala el rootkit en el sistema de destino. A menudo lo hace provocando un desbordamiento de b&uacute;fer. Este es un exploit habitual que permite a los hackers introducir su c&oacute;digo en &aacute;reas por lo dem&aacute;s inaccesibles de la memoria de un equipo.</p>

    <br>
    <br>
    <br>

    <center><img src="img/addware4.webp"></center>

    <br>
    <br>
    <br>

    <p>Los rootkits incluyen un «dropper» y un «loader» que funcionan juntos para realizar un ataque.</p>

    <p>La dificultad para el ciberdelincuente es introducir el paquete de amenaza combinada. A continuaci&oacute;n, se detallan algunas de las estrategias que pueden utilizar los hackers para hacer esto e instalar un rootkit en su equipo:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Secuestrar los programas de mensajer&iacute;a: Una amenaza combinada puede secuestrar los clientes de mensajer&iacute;a instant&aacute;nea y propagarse entre los contactos de la v&iacute;ctima. Cuando los destinatarios hacen clic en el enlace malicioso del mensaje, sus equipos se infectan tambi&eacute;n. Este tipo de ataque de ingenier&iacute;a social es un m&eacute;todo muy eficaz para propagar los rootkits.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Fisgonear en un software de confianza: Los hackers pueden insertar un rootkit de equipo en programas y aplicaciones que parecen de confianza y, a continuaci&oacute;n, cargar estas aplicaciones envenenadas en distintos portales de descarga. Cuando alguien instala la aplicaci&oacute;n infectada, instala tambi&eacute;n sin saberlo el rootkit.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Usar otro malware: Pueden utilizarse virus y troyanos como propagadores de rootkits, ya que son muy eficaces a la hora de colarse en su equipo. Cuando ejecuta el programa que contiene el virus, o cuando ejecuta el troyano, el rootkit se instala en su dispositivo.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Esconderse en archivos con contenido enriquecido: Con la llegada de los archivos con contenido enriquecido como los PDF, los hackers ya no necesitan esconder el malware en sitios web o programas. Les basta con incrustar los rootkits en estos archivos. Cuando abre el archivo contaminado, el dropper del rootkit se ejecuta autom&aacute;ticamente.</p>

    <h3>Tipos de rootkits</h3>

    <p>Los expertos en seguridad dividen los rootkits en seis categor&iacute;as, basadas en la parte del equipo infectada y la profundidad de la infecci&oacute;n.</p>

    <p class="subdivision">Rootkits de modo de usuario</p>

    <p>Los rootkits de modo de usuario infectan la cuenta de administrador de su sistema operativo y obtienen los privilegios de m&aacute;ximo nivel necesarios para cambiar los protocolos de seguridad de su equipo, a la vez que se ocultan as&iacute; mismos y ocultan cualquier otro malware que utilicen. Estos rootkits se inician autom&aacute;ticamente cuando arranca el equipo, as&iacute; que un simple reinicio no basta para limpiar la infecci&oacute;n. Los programas de an&aacute;lisis y eliminaci&oacute;n de malware como Avast Free Antivirus pueden detectar los rootkits de modo de usuario, ya que el software de detecci&oacute;n de rootkits se ejecuta a un nivel m&aacute;s profundo, conocido como kernel.</p>

    <p class="subdivision">Rootkits de modo kernel</p>

    <p>Como respuesta a los analizadores de rootkits en el nivel de kernel, los hackers crearon los rootkits de modo kernel. Residen en el mismo nivel del equipo que el propio sistema operativo y, por tanto, comprometen dicho sistema por completo. Cuando se infecta con un rootkit de modo kernel, ya no hay nada en su equipo de lo que pueda fiarse: todo est&aacute; potencialmente contaminado, incluidos los resultados de cualquier an&aacute;lisis antirootkit. Por suerte, es muy dif&iacute;cil crear un rootkit de modo kernel que pueda operar sin causar bloqueos del sistema frecuentes y otros problemas de funcionamiento que revelen su presencia.</p>

    <p class="subdivision">Rootkits h&iacute;bridos</p>

    <p>Los rootkits h&iacute;bridos ponen algunos de sus componentes en el nivel de usuario y otros en el kernel. De este modo, un rootkit h&iacute;brido disfruta de la estabilidad de los rootkits de modo de usuario, pero con el sigilo potenciado de sus primos del kernel. Como cab&iacute;a imaginar, los rootkits h&iacute;bridos de usuario y kernel son muy populares entre los ciberdelincuentes.</p>

    <p class="subdivision">Rootkits de firmware</p>

    <p>El firmware es un tipo de software de bajo nivel que controla un elemento hardware del equipo. Algunos rootkits pueden esconderse en el firmware cuando apaga el equipo. Cuando vuelve a encenderlo, un rootkit de firmware es capaz de reinstalarse y volver al trabajo. Si un analizador encuentra y desactiva un rootkit de firmware mientras est&aacute; en funcionamiento, el rootkit reaparecer&aacute; la pr&oacute;xima vez que encienda el equipo. Es bastante complicado purgar un sistema inform&aacute;tico de los rootkits de firmware.</p>

    <p class="subdivision">Bootkits</p>

    <p>Cuando se enciende el equipo, este consulta el registro de arranque principal (MBR, por sus siglas en ingl&eacute;s) para obtener instrucciones acerca de c&oacute;mo debe cargar el sistema operativo. Los bootkits, tambi&eacute;n conocidos como rootkits bootloader, son una variante del rootkit de modo kernel que infecta el MBR de su equipo. Siempre que el equipo consulta el MBR, el bootkit tambi&eacute;n se carga. A los programas antimalware les cuesta detectar los bootkits, como sucede con todos los rootkits de modo kernel, ya que no residen en el sistema operativo. Afortunadamente, los bootkits han quedado obsoletos porque tanto Windows 8 como Windows 10 los contrarrestan con la funci&oacute;n de Arranque seguro.</p>

    <p class="subdivision">Rootkits virtuales</p>

    <p>Una m&aacute;quina virtual es una emulaci&oacute;n basada en software de un equipo independiente hospedada en un equipo f&iacute;sico. Las m&aacute;quinas virtuales se utilizan para ejecutar varios sistemas operativos en una misma m&aacute;quina, o para probar programas en un entorno aislado. Los rootkits virtuales, o rootkits basados en m&aacute;quinas virtuales (VMBR, por sus siglas en ingl&eacute;s), se cargan bajo el sistema operativo original y despu&eacute;s ponen dicho sistema operativo en una m&aacute;quina virtual. Dado que se ejecutan independientemente del sistema operativo del equipo, son muy dif&iacute;ciles de detectar.</p>

    <h3>Ejemplos de rootkits</h3>

    <p>Cuando aparece un nuevo rootkit, se convierte de inmediato en uno de los problemas m&aacute;s urgentes para la ciberseguridad. Echemos un vistazo a algunos de los ejemplos de rootkits m&aacute;s conocidos de la historia. Algunos fueron creados por hackers y otros, sorprendentemente, los idearon y utilizaron grandes corporaciones.</p>

    <br>
    <br>
    <br>

    <center><img src="img/addware5.webp"></center>

    <br>
    <br>
    <br>

    <p>Cronolog&iacute;a de algunos de los ejemplos m&aacute;s conocidos de ataques de rootkits.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">1990: Lane Davis y Steven Dake crean el primer rootkit conocido en Sun Microsystems para el sistema operativo Unix SunOS.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">1999: Greg Hoglund publica un art&iacute;culo donde describe c&oacute;mo cre&oacute; un troyano denominado NTRootkit, el primer rootkit para Windows. Es un ejemplo de virus rootkit que funciona en modo kernel.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">2003: El rootkit de modo de usuario HackerDefender aparece para Windows 2000 y Windows XP. La llegada de HackerDefender inici&oacute; un juego del gato y el rat&oacute;n entre el malware y la herramienta antirootkit RootkitRevealer.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">2004: Se utiliza un rootkit para pinchar m&aacute;s de 100 tel&eacute;fonos m&oacute;viles de la red de Vodafone en Grecia, incluido el utilizado por el primer ministro, en un ataque que se llegar&iacute;a a conocer como el Watergate griego.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">2005: Sony BMG se ve envuelta en un gran esc&aacute;ndalo tras distribuir CD que instalan rootkits como herramienta antipirater&iacute;a sin el consentimiento previo de los consumidores.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">2008: El bootkit TDL-4, entonces conocido como TDL-1, impulsa el infausto troyano Alureon, empleado para crear y mantener redes de robots.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">2009: La prueba de concepto de rootkit Machiavelli ataca macOS (entonces denominado Mac OS X); este hecho demuestra que los Mac tambi&eacute;n son vulnerables al malware de tipo rootkit.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">2010: El gusano Stuxnet, presuntamente desarrollado por Estados Unidos e Israel, utiliz&oacute; un rootkit para ocultar su presencia y atacar el programa nuclear de Ir&aacute;n.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">2012: Un malware modular de 20 MB conocido como Flame siembra el caos en infraestructuras de Oriente Pr&oacute;ximo y el norte de &Aacute;frica. (Es comparativamente enorme, ya que la gran mayor&iacute;a del malware ocupa menos de 1 MB). </p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">2018: LoJax es el primer rootkit que infecta el UEFI de un equipo, el firmware que controla la placa base, lo que le permite sobrevivir incluso a la reinstalaci&oacute;n del sistema operativo.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">2019: Este ataque reciente proviene de Scranos, un rootkit que roba las contraseñas y los datos de pago almacenados en su navegador. Adem&aacute;s, convierte su equipo en una granja de clics para generar ingresos derivados de los vídeos y suscriptores de YouTube a escondidas.</p>

    <br>
    <br>
        
    <h3 class="hh">#6. Keylogger.</h3>

    <br>
    <br>
        
    <p><img src="img/keylogger.jpg" align="right" width="300" height="150" class="img-right">Aunque tambi&acute;n existen versiones que funcionan a trav&eacute;s de dispositivos o complementos para hardware, hablamos b&aacute;sicamente de programas que pueden llegar a un equipo a trav&eacute;s de virus, troyanos, etc. <br>y que se dedican a memorizar las pulsaciones de teclado que realiza el usuario. La informaci&oacute;n queda registrada en un archivo y puede ser enviada a trav&eacute;s de Internet. Como puedes imaginar, los ciberdelincuentes pueden hacerse con todo tipo de contraseñas, datos bancarios y cualquier otro tipo de informaci&oacute;n privada.</p>

    <h3>¿Qu&eacute; es un keylogger?</h3>
    
    <p>Un keylogger (abreviatura de «keystroke logging», o registro de pulsaciones de teclas) es un tipo de software malicioso que registra todas las pulsaciones de teclas que realice en el ordenador. Los keyloggers son un tipo de spyware, es decir, un software malicioso diseñado para espiar a las v&iacute;ctimas. Debido a su capacidad para registrar todo lo que escriba, los keyloggers son una de las formas m&aacute;s invasivas de malware. Existen dos tipos principales de keyloggers: de software y de hardware. El software keylogger es m&aacute;s com&uacute;n que el hardware, porque este &uacute;ltimo requiere un acceso f&iacute;sico real a un dispositivo.</p>

    <p class="subdivision">Software keylogger</p>

    <p>El software keylogger es m&aacute;s com&uacute;n que el hardware, porque no se necesita acceso f&iacute;sico al dispositivo objetivo. El software keylogger funciona como otro software malicioso: se infiltra en el dispositivo a trav&eacute;s de enlaces o archivos adjuntos maliciosos, o incluso mediante exploits o troyanos. Un keylogger se ejecuta silenciosamente en el fondo del ordenador hasta que lo descubra y lo elimine. El software keylogger suele ser malicioso, pero algunas empresas y padres lo usan para vigilar a los empleados y a los niños. Seg&uacute;n su aplicaci&oacute;n, el software de seguimiento del tiempo y las aplicaciones de control parental pueden rozar f&aacute;cilmente el territorio del espionaje. Cuando los keyloggers se usan para espiar a los seres queridos, se les conoce como stalkerware.</p>

    <p class="subdivision">¿Qu&eacute; puede hacer el software keylogger?</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Registrar todas las teclas que pulse, incluidas sus contraseñas y n&uacute;meros de tarjetas de cr&eacute;dito.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Registrar ambas partes de las conversaciones en las aplicaciones de mensajer&iacute;a y los correos electr&oacute;nicos.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Registrar el historial de navegaci&oacute;n y b&uacute;squeda.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Realizar capturas de pantalla cuando se escriban determinadas palabras clave.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Tomar el control remoto del dispositivo.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Iniciar o cerrar la sesi&oacute;n del dispositivo de forma remota.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Registrar durante cu&aacute;nto tiempo usa determinadas aplicaciones.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Imprimir registros o enviarlos por correo electr&oacute;nico al pirata inform&aacute;tico.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Esconderse en segundo plano.</p>

    <br>
    <br>
    <br>
    
    <center><img src="img/keyloggerquehace.webp"></center>

    <br>
    <br>
    <br>

    <p>Los keyloggers registran lo que escribe y esp&iacute;an sus contraseñas, mensajes y mucho m&aacute;s.</p>

    <h3>Keyloggers basados en hardware</h3>

    <p>Los keyloggers basados en hardware adoptan la forma de un dispositivo f&iacute;sico, como una memoria USB u otro elemento que puede tener un aspecto similar al de un cargador. Registran las pulsaciones del teclado y otros datos, para que un pirata inform&aacute;tico los recupere m&aacute;s tarde. Los keyloggers de hardware son dif&iacute;ciles de detectar con un software antivirus. Para que un pirata inform&aacute;tico pueda instalar un keylogger basado en hardware, debe tener acceso f&iacute;sico a su dispositivo. Por lo general, tratar&aacute;n de ocultar el hardware en la parte trasera de una torre de PC de sobremesa o en alg&uacute;n otro lugar en el que sea poco probable que mire.</p>

    <h3>¿C&oacute;mo funcionan los keyloggers?</h3>

    <p>Los keyloggers funcionan col&aacute;ndose en el ordenador, a menudo ocultos dentro de un troyano u otro malware. Un keylogger registra las pulsaciones del teclado en pequeños archivos que el atacante pueda ver. Los archivos pueden enviarse peri&oacute;dicamente por correo electr&oacute;nico al pirata inform&aacute;tico, subirse a un sitio web o a una base de datos, o transmitirse de forma inal&aacute;mbrica. Con los keyloggers basados en hardware, los archivos pueden quedar almacenados en el ordenador hasta que el pirata inform&aacute;tico recupere el dispositivo de registro de teclas.</p>

    <br>
    <br>
    <br>

    <center><img src="img/keyloggercomo.webp"></center>

    <br>
    <br>
    <br>

    <p>Los keyloggers se esconden en su dispositivo, registran sus pulsaciones del teclado y se las env&iacute;an al atacante.</p>

    <h3>Por qu&eacute; los keyloggers son una amenaza</h3>

    <p>Dado que los keyloggers pueden registrar todo lo que escriba, suponen un enorme riesgo para la seguridad de sus datos. Un pirata inform&aacute;tico con acceso a sus nombres de usuario y contraseñas est&aacute; a un paso de cometer un fraude de identidad, un robo monetario, de vender sus datos privados en la red oscura o a corredores de datos, de exponer su informaci&oacute;n personal y de causar todo tipo de estragos.</p>

    <p>Los keyloggers son una de las formas m&aacute;s peligrosas de malware que existen.</p>

    <h3>¿Se pueden detectar los keyloggers?</h3>

    <p>S&iacute;, los keyloggers pueden detectarse, pero puede resultar complicado. Como la mayor&iacute;a de los tipos de software malicioso, los keyloggers est&aacute;n diseñados para permanecer ocultos. La forma m&aacute;s f&aacute;cil de detectar el malware es usar un software antivirus potente que detecte y bloquee los keyloggers antes de que lleguen a infectarle el dispositivo.</p>

    <p>Si cree que ya se ha infectado con un keylogger, preste atenci&oacute;n a las t&iacute;picas señales de advertencia y use inmediatamente una herramienta de eliminaci&oacute;n de malware.</p>

    <p class="subdivision">¿Cu&aacute;les son las señales de advertencia de los keyloggers?</p>

    <p>Las señales de advertencia de los keyloggers son similares a las de otros tipos de malware. Debe prestar atenci&oacute;n a esto si cree que puede tener un keylogger en su dispositivo:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Un rendimiento lento. Si de pronto su ordenador transmite todas sus pulsaciones a un pirata inform&aacute;tico, su rendimiento se ver&aacute; afectado en todos los aspectos.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Bloqueos y errores inesperados. Toda la potencia de procesamiento necesaria para el registro puede hacer que sus otras aplicaciones se bloqueen y se cuelguen m&aacute;s a menudo de lo habitual.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Cambios en la configuraci&oacute;n. Si de repente tiene una nueva p&aacute;gina de inicio del navegador, barras de herramientas o iconos, podr&iacute;a ser una señal de software malicioso como un keylogger.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Redireccionamientos extraños. Si teclea b&uacute;squedas y se le redirige a un motor de b&uacute;squeda inesperado o a p&aacute;ginas web que parecen un tanto extrañas, podr&iacute;a tratarse de una redirecci&oacute;n maliciosa.</p>

    <h3>¿Los keyloggers son ilegales?</h3>

    <p>La legalidad de los keyloggers depende del consentimiento ; los keyloggers son ilegales sin &eacute;l. Si trabaja para una empresa que usa software de monitorizaci&oacute;n o seguimiento de empleados, tiene que acordar en su contrato que da su consentimiento a este tipo de registro de teclas. Los padres est&aacute;n legalmente autorizados a vigilar a sus hijos si son menores de 18 años. El registro malicioso de teclas por parte de piratas inform&aacute;ticos contra las v&iacute;ctimas es ilegal. La v&iacute;ctima no dio su consentimiento para que la vigilasen, y el registro de teclas va en contra de varias leyes sobre robo de datos, escuchas telef&oacute;nicas, ciberdelincuencia y pirater&iacute;a inform&aacute;tica.</p>

    <p>Por lo general, es legal instalar un keylogger en dispositivos que sean de su propiedad, pero no en los que no lo sean. Incluso dejar que alguien tome prestado su ordenador sin informarle de su keylogger es ilegal. Y usar la informaci&oacute;n obtenida ilegalmente del registro de teclas, como nombres de usuario y contraseñas, para otros delitos, como el robo o el fraude, puede dar lugar a sanciones penales a&uacute;n m&aacute;s duras.</p>

    <p class="subdivision">¿Qui&eacute;n usa keyloggers?</p>

    <p>Los keyloggers no son expl&iacute;citamente maliciosos, y a veces incluso se usan con fines leg&iacute;timos. Estas son algunas de las personas que podr&iacute;an usar keyloggers:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Padres y madres: Algunos programas de control parental son esencialmente spyware o incluso un keylogger. Aunque es legal que los padres vigilen a sus hijos menores de edad, hacerlo puede erosionar las relaciones familiares. Le recomendamos que hable abiertamente de la seguridad en Internet con sus hijos.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Empresas: Algunas empresas utilizan keyloggers (denominados «software de supervisi&oacute;n de empleados») para rastrear las aplicaciones que usan los empleados y c&oacute;mo utilizan su tiempo. Pero las empresas necesitan su consentimiento para hacerlo.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Soporte de TI: Si tiene un problema con el ordenador, el departamento de TI puede usar un keylogger para observar lo que ocurre a distancia y encontrar una soluci&oacute;n. Pero tambi&eacute;n necesitan su consentimiento. Tenga cuidado con las estafas de soporte t&eacute;cnico.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Aplicaci&oacute;n de la ley: La polic&iacute;a puede usar software de registro de teclas para rastrear la actividad de los sospechosos, pero necesita autorizaci&oacute;n mediante las correspondientes &oacute;rdenes de registro.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Hackers: Cuando la mayor&iacute;a de la gente piensa en keyloggers, tienen a los piratas inform&aacute;ticos en mente.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Abusadores: Una tendencia preocupante: el stalkerware va en aumento y los keyloggers pueden usarse junto con la violencia de pareja. Consulte esta gu&iacute;a de seguridad digital para supervivientes de violencia de pareja si necesita ayuda.</p>

    <h3>C&oacute;mo evitar los registros de teclas</h3>

    <p>La mejor manera de prevenir los registros de teclas es practicar h&aacute;bitos digitales inteligentes y de higiene. Si pone en pr&aacute;ctica estos consejos evitar&aacute; los keyloggers junto con los virus, ransomware, adware y otros tipos de malware.</p>

    <p>As&iacute; puede evitar los registros de teclas:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Instale un bloqueador de anuncios y evite hacer clic en las ventanas emergentes. Aunque es poco frecuente, los anuncios pueden contener malware, y en todo caso es buena idea usar un bloqueador de anuncios.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Tenga cuidado con los archivos adjuntos. Si un contacto le env&iacute;a un archivo adjunto que no esperaba, tenga cuidado antes de hacer clic. Es posible que hayan sido v&iacute;ctimas de un ataque inform&aacute;tico y que el archivo adjunto ejecute un malware al hacer clic en &eacute;l.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Nunca facilite informaci&oacute;n personal por correo electr&oacute;nico. Las empresas leg&iacute;timas no se pondr&aacute;n en contacto con usted para pedirle su contraseña u otra informaci&oacute;n personal. Estas solicitudes son probablemente intentos de phishing, es decir, piratas inform&aacute;ticos que intentan usar m&eacute;todos de ingenier&iacute;a social para acceder a sus datos.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Instale siempre las actualizaciones cuando est&eacute;n disponibles. Las actualizaciones contienen correcciones de errores y parches de seguridad que evitan los exploits, entre otras cosas.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Descargue software solo de fuentes de confianza. Los sitios de descarga de terceros pueden agrupar software leg&iacute;timo con bloatware o software malicioso.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">No deje sus dispositivos sin supervisi&oacute;n en p&uacute;blico. Un pirata inform&aacute;tico podr&iacute;a estar al acecho en la cafeter&iacute;a, listo para instalar un keylogger de software o hardware.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Utilice un software antivirus potente. Instalar un antivirus potente es la mejor protecci&oacute;n contra todo tipo de software malicioso.</p>

    <br>
    <br>
        
    <h3 class="hh">#7. Ataque Man In The Middle (MITM).</h3>

    <br>
    <br>
        
    <p><img src="img/man%20in%20the%20middle.png" align="left" width="300" height="160" class="img-left">Es un tipo de ataque en que el hacker intercepta tr&aacute;fico que viaja de un equipo emisor a otro receptor. <br>Por eso se llama Man in the middle, que en español significa “Hombre en el medio”. <br>Al convertirse en un punto intermedio por donde pasa la informaci&oacute;n desde su lugar de origen (el equipo de un empleado, por ejemplo), a un emplazamiento de destino (supongamos que es el servidor de la compañ&iacute;a), el ciberdelincuente puede descifrar los datos y hacerse con claves y contraseñas.</p>

    <h3>¿Qu&eacute; es un ataque man-in-the-middle?</h3>

    <p>El objetivo de la mayor&iacute;a de los ciberdelincuentes es robar la informaci&oacute;n valiosa para los usuarios. Los ataques pueden ser dirigidos a usuarios individuales, p&aacute;ginas web famosas o bases de datos financieros. Aunque la metodolog&iacute;a sea diferente en cada situaci&oacute;n, el fin siempre es el mismo. En la mayor&iacute;a de los casos, los criminales intentan, en primer lugar, insertar alg&uacute;n tipo de malware en el equipo de la v&iacute;ctima, ya que &eacute;sta es la ruta m&aacute;s corta entre ellos y los datos que tanto desean. Si esto no les resulta posible, otra forma com&uacute;n es el ataque Man-in-the-Middle. Como sugiere su nombre en ingl&eacute;s, en este m&eacute;todo se introduce un intermediario (el cibercriminal o una herramienta maliciosa) entre la v&iacute;ctima y la fuente: una p&aacute;gina de banca online o una cuenta de correo electr&oacute;nico. Estos ataques son realmente efectivos y, a su vez, muy dif&iacute;ciles de detectar por el usuario, quien no es consciente de los daños que puede llegar a sufrir.</p>

    <br>
    <br>
    <br>

    <center><img src="img/manion.jpg"></center>

    <br>
    <br>
    <br>
    
    <h3>Definici&oacute;n de ataque Man-in-the-Middle</h3>

    <p>El concepto de un ataque MiTM es muy sencillo. Adem&aacute;s, no se limita &uacute;nicamente al &aacute;mbito de la seguridad inform&aacute;tica o el mundo online. Este m&eacute;todo s&oacute;lo necesita que el atacante se sit&uacute;e entre las dos partes que intentan comunicarse; interceptando los mensajes enviados e imitando al menos a una de ellas. Por ejemplo, en el mundo offline, se crear&iacute;an facturas falsas, envi&aacute;ndolas al correo de la v&iacute;ctima e interceptando los cheques de pago de dichos recibos. En el mundo online, un ataque MiTM es mucho m&aacute;s complejo, pero la idea es la misma. El atacante se sit&uacute;a entre el objetivo y la fuente; pasando totalmente desapercibido para poder alcanzar con &eacute;xito la meta.</p>

    <h3>Variantes de ataque MiTM</h3>

    <p>En el ataque MiTM m&aacute;s habitual, se utiliza un router WiFi para interceptar las comunicaciones del usuario. Esto se puede realizar configurando el router malicioso para que parezca leg&iacute;timo o atacando un error del mismo e interceptando la sesi&oacute;n del usuario. En el primero de los casos, el atancante configura su ordenador u otro dispositivo para que act&uacute;e como red WiFi, nombr&aacute;ndolo como si fuera una red p&uacute;blica (de un aeropuerto o una cafeter&iacute;a). Despu&eacute;s, el usuario se conecta al “router” y busca p&aacute;ginas de banca o compras online, capturando el criminal las credenciales de la v&iacute;ctima para usarlas posteriormente. En el segundo caso, un delincuente encuentra una vulnerabilidad en la configuraci&oacute;n del sistema de cifrado de un WiFi leg&iacute;timo y la utiliza para interceptar las comunicaciones entre el usuario y el router. &Eacute;ste es el m&eacute;todo m&aacute;s complejo de los dos, pero tambi&eacute;n el m&aacute;s efectivo; ya que el atacante tiene acceso continuo al router durante horas o d&iacute;as. Adem&aacute;s, puede husmear en las sesiones de forma silenciosa sin que la v&iacute;ctima sea consciente de nada.</p>

    <p>Una variante m&aacute;s reciente de este tipo de ataque es el ataque man-in-the-browser. En este contexto, el ciberdelincuente usa una serie de m&eacute;todos para insertar un c&oacute;digo malicioso en el equipo de la v&iacute;ctima, el cual funciona dentro del navegador. Este malware registra, silenciosamente, los datos enviados entre el navegador y las p&aacute;ginas. Estos ataques han ganado en popularidad porque permiten al delincuente atacar a un grupo mayor de v&iacute;ctimas sin la necesidad de estar cerca de &eacute;stas.</p>

    <h3>Defensa</h3>

    <p>Existen diferentes formas efectivas para defendernos de los ataques MiTM, pero la mayor&iacute;a de ellas usan un router/servidor y no permiten que el usuario controle la seguridad de la transacci&oacute;n que realiza. Este m&eacute;todo de defensa usa un sistema de cifrado fuerte entre el cliente y el servidor. En este caso, el servidor se verifica as&iacute; mismo presentando un certificado digital y se establece un canal cifrado entre el cliente y el servidor a trav&eacute;s del que se env&iacute;a la informaci&oacute;n confidencial. Adem&aacute;s, los usuarios pueden protegerse de estos ataques evitando conectarse a routers WiFi abiertos o usando plugins de navegador como HTTPS Everywhere o ForceTLS; los cuales establecen una conexi&oacute;n segura siempre que sea posible. Sin embargo, cada una de estos m&eacute;todos tiene sus l&iacute;mites y existen ejemplos de ataques como SSLStrip o SSLSniff que pueden invalidar la seguridad de las conexiones SSL.</p>

    <br>
    <br>
        
    <h3 class="hh">#8. Ataques DOS.</h3>

    <br>
    <br>
        
    <p><img src="img/dos.png" align="right" width="160" height="250" class="img-right">Tener la p&aacute;gina web de empresa ca&iacute;da durante alg&uacute;n tiempo puede suponer importantes p&eacute;rdidas econ&oacute;micas, ¡sobre todo si se trata de una tienda online! Ese es el objetivo de los ataques de Denial Of Service (DOS), o de “denegaci&oacute;n de servicio”. Un ordenador lanza peticiones al servidor en el que se aloja el sitio web hasta que lo satura y empieza a denegar el acceso. La web cae con sus correspondientes p&eacute;rdidas en ventas, oportunidades de negocio, etc. Para detener el ataque basta con banear la IP del atacante. Pero si el tiempo en que permanece la web ca&iacute;da es el suficiente, las p&eacute;rdidas ya han tenido lugar y el daño est&aacute; hecho.</p>

    <h3>¿Qu&eacute; es DoS (denial of service)?</h3>

    <p>En sus or&iacute;genes, denial of service o DoS se empleaba cuando algunos servicios de internet dejaban de estar disponibles temporalmente en un sistema de TI, como un servidor. Esto ocurre cuando los servidores correspondientes se sobrecargan, por ejemplo, por un n&uacute;mero excesivo de solicitudes de los usuarios. Los servicios de internet incluyen sitios web, servicios de correo electr&oacute;nico o funciones de chat. En un ataque DoS, el atacante causa esta “negaci&oacute;n de servicio” deliberadamente. Para esto, “bombardea” las conexiones de red del sistema inform&aacute;tico responsable del intercambio de datos externos con multitud de solicitudes, con el fin de sobrecargarlas. Si el n&uacute;mero de solicitudes supera la capacidad del sistema, este se ralentiza o se paraliza por completo, de modo que ya no se pueda acceder a sitios web, funciones de correo electr&oacute;nico o tiendas en l&iacute;nea. Un ataque DoS se puede comparar a una situaci&oacute;n en una tienda real en la que entran cientos de personas que distraen al personal de ventas con preguntas engañosas, bloquean recursos y no realizan ninguna compra. El personal se sobrecarga hasta que no puede atender a nadie m&aacute;s y los clientes reales no pueden entrar en la tienda o no se les puede atender.</p>

    <center><img src="img/dos2.png"></center>
        
    <p>Los ataques DoS puros son, en principio, relativamente f&aacute;ciles de realizar, sobre todo porque para realizarlos no es necesario penetrar en las medidas de seguridad de un sistema inform&aacute;tico. Incluso es posible llevar a cabo este ataque ilegal con un presupuesto relativamente reducido y sin conocimientos t&eacute;cnicos. Se pueden encontrar ciberdelincuentes dispuestos a realizar este tipo de ataques por pocos cientos de euros en la darknet. Si las empresas y organizaciones no est&aacute;n preparadas para los ataques DoS, quedan expuestas a enormes daños con un m&iacute;nimo esfuerzo por parte de los malhechores.</p>

    <h3>¿C&oacute;mo se reconoce un ataque DoS?</h3>

    <p>Un posible indicio de que est&aacute;s pasando por un ataque DoS es el rendimiento inusualmente lento de toda la red, lo que se nota especialmente al abrir archivos o los propios sitios web. Un ataque DoS exitoso es tambi&eacute;n f&aacute;cil de apreciar desde el exterior: los sitios web atacados cargan muy lentamente. Adem&aacute;s, algunas funciones, como por ejemplo las de tienda en l&iacute;nea, dejan de funcionar por completo. En el punto &aacute;lgido del ataque, muchos sitios web dejan de estar accesibles.</p>
    
    <p>Puedes determinar si has sido v&iacute;ctima de un ataque DoS supervisando y analizando el tr&aacute;fico de red con ayuda de un cortafuegos o con otro sistema de detecci&oacute;n de ataques (Intrusion Detection System). Los administradores de la red tienen la capacidad de establecer criterios para detectar el tr&aacute;fico anormal. Si el n&uacute;mero de solicitudes sospechosas al sistema aumenta, se activa autom&aacute;ticamente una alarma. Esto permite tomar contramedidas lo antes posible.</p>

    <h3>¿C&oacute;mo funcionan los ataques DoS a nivel t&eacute;cnico?</h3>

    <p>En la actualidad existen muchos tipos diferentes de ataques DoS, que pueden distinguirse a grandes rasgos en ataques contra el ancho de banda, ataques contra los recursos del sistema y ataques que aprovechan las vulnerabilidades de seguridad y los errores de software. Para entender c&oacute;mo proceden los malhechores en un ataque DoS y qu&eacute; medidas pueden tomarse para contrarrestarlo, se puede tomar como ejemplo el ataque pitufo o smurf attack. Este es un tipo espec&iacute;fico de ataque DoS dirigido al sistema operativo o la conexi&oacute;n a internet de un sistema o red inform&aacute;tica. El atacante env&iacute;a pings, paquetes de datos ICMP del tipo Echo Request o “solicitud de eco”, a la direcci&oacute;n de emisi&oacute;n de una red. En estos paquetes de datos, el malhechor introduce la direcci&oacute;n del sistema que ataca. Entonces, todos los ordenadores de la red env&iacute;an una respuesta a este sistema, asumiendo err&oacute;neamente que las solicitudes provienen de este. Cuantos m&aacute;s ordenadores formen parte de la red utilizada por el atacante, mayor ser&aacute; el n&uacute;mero de supuestas respuestas y m&aacute;s devastador ser&aacute; el ataque.</p>
        
    <p>Para evitar los ataques pitufos, los sistemas ya no responden a los paquetes de tipo “solicitud de eco” de la ICMP y los enrutadores ya no reenv&iacute;an los paquetes dirigidos a las direcciones de difusi&oacute;n de forma predeterminada. Esta medida de seguridad general ha hecho que los ataques pitufos raras veces tengan &eacute;xito.</p>

    <br>
    <br>
    <br>

    <center><img src="img/dos.webp"></center>

    <h3>Medidas contra ataques DoS</h3>

    <p>Existen varias medidas para proteger tu infraestructura contra los ataques de negaci&oacute;n de servicio, que puedes combinar entre ellas para reforzarlas. En particular, debes configurar correctamente tus enrutadores y protegerlos con contraseñas fuertes. Con instalar medidas de protecci&oacute;n en estos nodos, ya se pueden evitar muchos ataques DoS. De este modo, los paquetes de ataque ya no se admiten en la estructura interna. Un buen cortafuego proporciona seguridad adicional.</p>

    <p>Despu&eacute;s de determinar el objetivo de un ataque, puedes dedicarle recursos adicionales. La distribuci&oacute;n de carga, por ejemplo, permite solicitar capacidad adicional al proveedor de alojamiento con poca antelaci&oacute;n para as&iacute; frustrar ataques DoS antes de que se produzcan.</p>
        
    <p>Nuestro art&iacute;culo contiene una descripci&oacute;n m&aacute;s precisa de la diferencia entre DDoS y DoS.</p>

    <h3>Ataques DDoS - denial of service en la actualidad</h3>

    <p>La mayor&iacute;a de los ataques DoS de hoy en d&iacute;a toman la forma de ataques Distributed Denial of Service, que se identifican con las siglas DDoS. Los ataques DoS y DDoS se diferencian porque, mientras que los ataques DoS tienen un origen &uacute;nico (por ejemplo, un ordenador o una red), los ataques DDoS se llevan a cabo de manera indirecta a trav&eacute;s de una red de bots, a menudo ampliamente distribuida (de ah&iacute; el t&eacute;rmino distributed).</p>

    <p>Una botnet consiste en un grupo de ordenadores pirateados, llamados zombis. Se trata, en general, de ordenadores mal mantenidos, cuyos propietarios raras veces se dan cuenta del software malicioso instalado en ellos o de que los est&aacute;n utilizando para actividades delictivas. El operador de una red de bots puede utilizar este ej&eacute;rcito de ordenadores zombis para atacar otros sistemas inform&aacute;ticos. Existen botnets compuestos por varios millones de ordenadores. Cuando se usan todos en un ataque DDoS, el n&uacute;mero de “solicitudes ileg&iacute;timas” a una red puede aumentar enormemente. Esta es una de las razones por la que incluso portales con enormes recursos, como Facebook, no est&aacute;n cien por cien seguros contra un ataque DDoS a gran escala.</p>

    <br>
    <br>
    <br>

    <center><img src="img/dosatack.jpg"></center>

    <br>
    <br>
    <br>

    <br>
    <br>
        
    <h3 class="hh">#9. Ataques DDOS.</h3>

    <br>
    <br>
        
    <p><img src="img/ddos.png" align="left" width="450" height="250" class="img-left">El concepto es el mismo que en la amenaza anterior: se realizan peticiones masivas hasta saturar el servidor y hacer caer la web. Sin embargo, el ataque del que hablamos ahora es un Distributed Denial Of Service (DDOS), y es m&aacute;s sofisticado que el anterior. En lugar de lanzar los ataques desde un &uacute;nico equipo, los ataques DDOS emplean muchos ordenadores para distribuir las peticiones al servidor. A menudo, esos equipos pertenecen a usuarios que no saben para qu&eacute; se est&aacute;n utilizando sus ordenadores, que han sido añadidos a una red Zombie por los hackers infect&aacute;ndolos con malware. El problema con este tipo de ataques es que al tener un origen m&uacute;ltiple es m&aacute;s dif&iacute;cil averiguar todas las IP de las que parte y, por lo tanto, es m&aacute;s dif&iacute;cil de detener. ¡Y estas amenazas solo son la punta del iceberg! Son las m&aacute;s comunes, pero hay muchas m&aacute;s. Adem&aacute;s, con la revoluci&oacute;n del Internet of Things (IoT) o “Internet de las cosas”, se espera que los retos a la seguridad de los dispositivos se incrementen de forma masiva. El aumento de dispositivos y bienes de consumo con acceso a la Red estimular&aacute; el desarrollo de nuevas amenazas de todo tipo. Quiz&aacute; temas no volver a dormir tranquilo pensando en la cantidad de amenazas inform&aacute;ticas que acechan a tu empresa, pero no te preocupes. ¡No todo est&aacute; perdido!</p>

    <h3>¿Qu&eacute; son los ataques DDoS?</h3>

    <p>Los ataques de red distribuidos a menudo se conocen como ataques de denegaci&oacute;n distribuida de servicio (DDoS). Este tipo de ataque aprovecha los l&iacute;mites de capacidad espec&iacute;ficos que se aplican a cualquier recurso de red, tal como la infraestructura que habilita el sitio web de la empresa. El ataque DDoS env&iacute;a varias solicitudes al recurso web atacado, con la intenci&oacute;n de desbordar la capacidad del sitio web para administrar varias solicitudes y de evitar que este funcione correctamente.</p>

    <p>Entre los objetivos m&aacute;s comunes de los ataques DDoS se incluyen:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Sitios de compra por Internet</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Casinos en l&iacute;nea</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Cualquier empresa u organizaci&oacute;n que dependa de la prestaci&oacute;n de servicios en l&iacute;nea.
    </p>

    <center><img src="img/ddosquees.jpg"></center>

    <p class="subdivision">C&oacute;mo funciona un ataque DDoS</p>
    
    <p>Los recursos de red (tales como los servidores web) tienen un l&iacute;mite finito de solicitudes que pueden atender al mismo tiempo. Adem&aacute;s del l&iacute;mite de capacidad del servidor, el canal que conecta el servidor a Internet tiene un ancho de banda o capacidad limitados. Cuando la cantidad de solicitudes sobrepasa los l&iacute;mites de capacidad de cualquiera de los componentes de la infraestructura, el nivel de servicio probablemente se vea afectado de alguna de las siguientes maneras:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">La respuesta a las solicitudes ser&aacute; mucho m&aacute;s lenta de lo normal.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="20" height="20">Es posible que se ignoren algunas (o todas) las solicitudes de los usuarios.</p>

    <p>Por regla general, la intenci&oacute;n primordial del atacante es evitar por completo el funcionamiento normal del recurso web, una "denegaci&oacute;n" total del servicio. El atacante tambi&eacute;n puede solicitar un pago para detener el ataque. En algunos casos, el objetivo del ataque DDoS puede ser desacreditar o dañar el negocio de un competidor.</p>

    <p class="subdivision">Uso de una "red zombi" de botnet para lanzar un ataque DDoS</p>

    <p>Para enviar una cantidad extremadamente grande de solicitudes al recurso v&iacute;ctima, el cibercriminal a menudo establece una "red zombi" de computadoras infectadas. Como el delincuente controla las acciones de cada computadora infectada en la red zombi, la gran escala del ataque puede desbordar los recursos web de la v&iacute;ctima.</p>

    <h3></h3>

    <h2 class="shi2">¿COMO EVITAR ESTOS RIESGOS INFORM&Aacute;TICOS?</h2>
        
    <h3>Supervisa el uso de correos electr&oacute;nicos.</h3>
        
    <p>Puede parecer obvio, pero ignorar la actividad de los correos internos es una falla com&uacute;n en todas las empresas. Los correos electr&oacute;nicos son uno de los puntos m&aacute;s d&eacute;biles de una organizaci&oacute;n, pues a trav&eacute;s de ellos se pueden introducir f&aacute;cilmente las amenazas. Monitorea la actividad de mensajes sospechosos, así como las descargas de archivos anexos. Asimismo, educa al personal de la empresa sobre el buen uso de este medio para que sea empleado solo con fines laborales.</p>
        
    <h3>Est&aacute; alerta del tr&aacute;fico anormal.</h3>
        
    <p>Recolecta datos para establecer el comportamiento anormal de la red: <br>protocolos, aplicaciones o actividad de los usuarios. Presta atención al volumen del tráfico y a los cambios inesperados en el uso del protocolo.</p>
        
    <h3>Identifica los c&oacute;digos maliciosos.</h3>
        
    <p>Los malwares y c&oacute;digos maliciosos generalmente se esconden en formatos comunes de archivo (PDF, html, GIF, Zip, etc.). <br>Una buena pr&aacute;ctica consiste en escoger un antivirus capaz de descubrir, decodificar y descifrar estos c&oacute;digos ocultos.</p>
        
    <h3>Reconoce las conexiones sospechosas.</h3>
        
    <p>Los cibercriminales a menudo usan direcciones IP, sitios web, archivos y servidores de correo electr&oacute;nico con un hist&oacute;rico de actividad maliciosa. <br>Utiliza herramientas capaces de examinar la reputaci&oacute;n de fuentes no confiables ubicadas fuera de tu organizaci&oacute;n.</p>
    
    <h3>Supervisa la alteraci&oacute;n de las aplicaciones.</h3>
        
    <p>Cuando un atacante consiga ingresar a la red de tu empresa, puede emitir comandos direccionados a aplicaciones clave. Para prevenirlo, crea una lista blanca (whitelisting) para especificar cu&aacute;les aplicaciones pueden ser ejecutadas. Paralelamente, establece una lista negra de programas no autorizados. De esa manera puedes prevenir cualquier intento de alteraci&oacute;n en el sistema, ya sea en el servidor de correo electr&oacute;nico, en los archivos, en los paquetes de software, etc.</p>
        
    <h3>Monitorea las bases de datos.</h3>
        
    <p>Intentos no autorizados de acceso a datos cr&iacute;ticos y de modificaci&oacute;n de la estructura en el banco de datos son señales de alerta que indican que su red puede estar siendo amenazada. Usa herramientas para monitorear bases de datos y registrar intentos de acceso no autorizado. Estas son algunas de ellas:</p>
        
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">Solarwinds DB Performance Analyzer.</p>
        
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">Idera SQL Diagnostic Manager.</p>
        
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">Lepide SQL Server Auditing.</p>
        
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">Heroix Longitude®.</p>
        
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">SQL Power Tools.</p>
        
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">Red-Gate SQL Monitor.</p>
        
    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">Sentry One (SQL Sentry).</p>
        
    <h3>Vigila la transferencia de datos.</h3>
        
    <p>Inspecciona los datos que sean propiedad intelectual de la empresa. <br>Asimismo, presta atenci&oacute;n al movimiento poco com&uacute;n de datos, de tr&aacute;fico criptografiado o transferencias de archivos sospechosos.</p>
        
    <h3>Mant&eacute;n tu sistema actualizado</h3>
        
    <p>Si se trata de un computador personal, no es difícil garantizar que el equipo tenga un buen funcionamiento. Sin embargo, cuando no es uno, sino un sinn&uacute;mero de computadores, la tarea se vuelve dispendiosa. La mejor manera de enfrentar este desaf&iacute;o es haciendo un inventario de todo el hardware disponible en la empresa y trav&eacute;s del m&oacute;dulo de seguridad de la informaci&acute;n de Pirani puedes hacerlo f&aacute;cilmente porque te permite gestionar todos los activos de informaci&oacute;n de tu empresa, as&iacute; como los riesgos de seguridad a los que estos est&aacute;n expuestos. Adem&aacute;s, para realizar las actualizaciones que los equipos requieren hay dos opciones: la primera es entrenar a los empleados para que las realicen peri&oacute;dicamente, y la segunda es automatizar el proceso a trav&eacute;s de una herramienta que actualice autom&aacute;ticamente el sistema. Esta &uacute;ltima opci&oacute;n permitir&acute; que se descarguen las actualizaciones de una sola vez y luego se van distribuyendo dentro de la empresa. La ventaja de este m&eacute;todo es que tendr&aacute;s la seguridad de que las actualizaciones est&aacute;n siendo instaladas en el momento en que lo indiques, sin tener que depender de intervenci&oacute;n humana. Asimismo, centralizar las actualizaciones permite ejecutar tareas de gerenciamiento de sistemas fuera del horario de trabajo, sin entorpecer las actividades diarias de los empleados. Adicional a estas ocho recomendaciones, para prevenir la materializaci&oacute;n de riesgos de seguridad de la informaci&oacute;n, es importante contar con una soluci&oacute;n tecnol&oacute;gica como Pirani que tambi&eacute;n permite identificar, evaluar, controlar y monitorear este tipo de riesgos para asegurar la confidencialidad, integridad y disponibilidad de la informaci&oacute;n en las organizaciones.</p>
        
    <div class="align-center"><p><img src="img/correo.jpg" align="left" width="400" height="250" class="img-left"><img src="img/trafico.jpg" align="left" width="400" height="250" class="img-left"><img src="img/malicioso.jpg" align="left" width="400" height="250"></p></div>
        
    <div class="align-center"><p><img src="img/conexiones.webp" align="left" width="400" height="250" class="img-left"><img src="img/alteracion.jpg" align="left" width="400" height="250" class="img-left"><img src="img/base.jpg" align="left" width="400" height="250" class="img-left"></p></div>
        
    <div class="align-center"><p><img src="img/transferencia.jpg" align="left" width="400" height="250" class="img-left"><img src="img/actualizado.jpeg" align="left" width="400" height="250" class="img-left"></p></div>
 
    <h2 class="shi2">ANTIVIRUS</h2>

    <br>
    <br>
        
    <h3 class="hh">¿Qu&eacute; es un antivirus?</h3>
    
    <br>
    <br>

    <p><img src="img/antivirus.webp" align="left" width="450" height="255" class="img-left">Un software antivirus comienza comparando tus archivos y programas inform&aacute;ticos con una base de datos de tipos de malware conocidos. Dado que los piratas inform&aacute;ticos crean y distribuyen constantemente nuevos virus, tambi&eacute;n escanear&aacute; las computadoras en busca de la posibilidad de tipos nuevos o desconocidos de amenazas de malware. Generalmente, la mayor&iacute;a de los programas usar&aacute; tres dispositivos de detecci&oacute;n diferentes: detecci&oacute;n espec&iacute;fica, la cual identifica el malware conocido; detecci&oacute;n gen&eacute;rica, la cual busca partes o tipos de malware conocido, o patrones que se relacionan en virtud de una base de c&oacute;digo com&uacute;n; y detecci&oacute;n heur&iacute;stica, la cual escanea virus desconocidos al identificar estructuras de archivos sospechosas conocidas. Cuando el programa encuentra un archivo que contiene un virus, generalmente lo pone en cuarentena y/o lo aparta para eliminarlo, lo que lo hace inaccesible y permite eliminar el riesgo de tu aparato.</p>

    <h3>Definici&oacute;n de antivirus</h3>

    <p>Los antivirus inform&aacute;ticos son piezas de software de aplicaci&oacute;n cuyo objetivo es detectar y eliminar de un sistema computarizado los virus inform&aacute;ticos. Es decir, se trata de un programa que busca poner remedio a los daños causados por estas formas invasivas de software, cuya presencia en el sistema no suele ser detectable sino hasta que se evidencian sus s&iacute;ntomas, tal y como los virus biol&oacute;gicos. Durante la d&eacute;cada de los 80, con la aparici&oacute;n de las tecnolog&iacute;as de intercambio de informaci&oacute;n digital como los disquetes y, m&aacute;s adelante, Internet, se hizo posible poner en contacto sucesivo a numerosas computadoras. Esto trajo consigo la aparici&oacute;n de los virus inform&aacute;ticos, y despu&eacute;s, del spyware, malware y otras formas de software perjudicial que ingresan sin consentimiento del usuario a la m&aacute;quina y causan diverso tipo de daños: desconfigurar secuencias clave, borrar archivos personales, secuestrar informaci&oacute;n privada, etc.</p>

    <p>El remedio, entonces, fue adquirir un antivirus inform&aacute;tico, ofrecidos por diversas empresas de programaci&oacute;n comercial para garantizar el monitoreo, limpieza y protecci&oacute;n de los computadores. En caso de carecer de ellos, el usuario corr&iacute;a riesgos de daños al sistema y de esparcir adem&aacute;s el virus cada vez que copiara un disquete o que enviara un correo electr&oacute;nico. Actualmente existe una oferta multitudinaria de servicios de antivirus, indispensables dado que pasamos cada vez m&aacute;s tiempo conectados a la Internet, recibiendo y enviando informaci&oacute;n de y a computadores desconocidos.</p>

    <h3>¿Para qu&eacute; sirven los antivirus inform&aacute;ticos?</h3>

    <p>En la actualidad, los antivirus sirven para m&aacute;s que simplemente escanear y desinfectar una m&aacute;quina que ha contra&iacute;do un virus inform&aacute;tico. Por lo general ofrecen servicios de monitoreo activo, para impedir el acceso total de un documento infectado al sistema, bloquear p&aacute;ginas web inseguras y eliminar archivos riesgosos apenas ingresen al computador. A esto suele llam&aacute;rsele protecci&oacute;n activa. Por otro lado, los antivirus inform&aacute;ticos lidian tambi&eacute;n con otras piezas de software no deseado, como el spyware, malware o rootkits, e incluso de intentos de hackeo. Para ello posee un firewall (software de bloqueo de conexiones remotas) y una base de datos de definiciones de virus, que es una suerte de enciclopedia de los virus ya conocidos.</p>

    <h3>Tipos de antivirus inform&aacute;ticos</h3>

    <p>Puede identificarse varios tipos de antivirus inform&aacute;tico, de acuerdo a su funcionamiento:</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">Antivirus de identificaci&oacute;n. Aquellos que rastrean secuencias activas asociadas a determinados virus, pero no son muy efectivos a la hora de lidiar con el software indeseado. Tienen la virtud de ser muy ligeros, algunos se ejecutan desde la red.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">Antivirus descontaminadores. Por lo general instalados en el sistema como cualquier otro software de aplicaci&oacute;n, estos programas pueden activarse a voluntad para revisar el contenido completo del computador en busca de virus. De haberlos, entonces, se procede a la desinfecci&oacute;n y, de no ser posible, a la cuarentena o el borrado.</p>

    <p class="ño"><img src="img/flecha1.jpg" align="left" width="30" height="30">Antivirus de protecci&oacute;n a tiempo real. Aquellos que brindan protecci&oacute;n constante al sistema, sin necesidad de llevar a cabo una revisi&oacute;n exhaustiva, sino revisando todos los archivos y conexiones entrantes y salientes. Estos antivirus suelen estar combinados con funciones descontaminadoras.</p>

    <br>
    <br>
</div>
</body>
    
</html>
